[{"id":3,"kind":"big_project","name":"Corewar","x":3891.0,"y":3000.0,"by":[{"parent_id":0,"points":[[3890.5,3000],[4037.5,3002]]}],"project_id":22,"difficulty":375,"duration":"about 0 days","rules":"You must have validated 1 of lem_in, first-internship, and startup-internship","description":"Ce projet vous invite à créer une arène virtuelle et à y faire s’affronter des programmes codés dans un langage simpliste. Vous allez ainsi aborder la conception d’une VM (avec les instructions qu’elle reconnait, les registres, etc), et les problématiques de compilation d’un langage assembleur en bytecode. Avec, en bonus, le plaisir de faire s’affronter vos champions sur votre arène !","slug":"corewar"},{"id":7,"kind":"project","name":"Malloc","x":3000.0,"y":1900.0,"by":[{"parent_id":118,"points":[[3000,2000],[3000,1900]]}],"project_id":36,"difficulty":225,"duration":"about 7 days","rules":"You must have finished quest(s) first-internship","description":"Que se cache derriere malloc ? Vous l'utilisez depuis la piscine C, mais ce n'est pas un appel système. Découvrez les rouages d'une gestion optimum de la mémoire, et recodez-le, ainsi que free et realloc.","slug":"malloc"},{"id":8,"kind":"piscine","name":"Piscine PHP","x":2600.0,"y":2744.0,"by":[],"project_id":48,"difficulty":100,"duration":null,"rules":"You must be at least level 5 in cursus 42","description":"La piscine PHP va vous permettre d'accéder aux technologies de base du web.","slug":"piscine-php"},{"id":9,"kind":"project","name":"Nm-otool","x":3000.0,"y":1600.0,"by":[{"parent_id":7,"points":[[3000,1900],[3000,1600]]}],"project_id":37,"difficulty":225,"duration":"about 14 days","rules":"You must have validated malloc","description":"Décortiquez le format des exécutables MacOS et comprenez comment le kernel lance les binaires, en ré-écrivant ces deux outils du système. Indispensable pour tous ceux qui voudront faire de la sécurité, ce projet est plus généralement une ouverture sur la culture UNIX système.","slug":"nm-otool"},{"id":12,"kind":"project","name":"ft_script","x":2899.0,"y":1800.0,"by":[{"parent_id":36,"points":[[3000,1900],[2999,1798]]},{"parent_id":36,"points":[[3001,1798],[2899,1800]]}],"project_id":38,"difficulty":100,"duration":"about 7 days","rules":"You must have validated malloc","description":"Recoder la commande script va être pour vous l'occasion de comprendre les intéractions entre input utilisateur et tty, notamment la line discipline, ainsi que les pseudo-terminaux. Ce projet terminé, vous saurez enfin pourquoi un Ctrl-C dans votre shell interromp le programme en cours !","slug":"ft_script"},{"id":16,"kind":"project","name":"LibftASM","x":2800.0,"y":1500.0,"by":[{"parent_id":37,"points":[[3000,1600],[2900,1500]]},{"parent_id":37,"points":[[2903,1500],[2800,1500]]}],"project_id":79,"difficulty":225,"duration":"about 7 days","rules":"You must have validated nm-otool","description":"Ce projet a pour but de vous faire coder une minilib en ASM, en recodant quelques fonctions basiques de la libc. A la fin de ce projet vous serez familiarisés avec la syntaxe du langage, le fonctionnement de la stack, mais aussi le comportement du compilateur. Absolument indispensable pour continuer sur les projets de sécurité.","slug":"libftasm"},{"id":18,"kind":"project","name":"ft_p","x":3400.0,"y":1500.0,"by":[{"parent_id":37,"points":[[3000,1600],[3075,1525]]},{"parent_id":37,"points":[[3075,1525],[3150,1600]]},{"parent_id":37,"points":[[3147,1600],[3275,1600]]},{"parent_id":37,"points":[[3275,1600],[3400,1500]]}],"project_id":40,"difficulty":225,"duration":"about 14 days","rules":"You must have validated nm-otool","description":"Ce projet introductif sur la programmation UNIX réseau vous invite à réaliser un client-serveur offrant des services identiques à ftp. Bonus : respectez le standard pour être interopérable avec les outils existants !","slug":"ft_p"},{"id":19,"kind":"project","name":"IRC","x":3400.0,"y":1700.0,"by":[{"parent_id":37,"points":[[3075,1525],[3150,1600]]},{"parent_id":37,"points":[[3147,1600],[3275,1600]]},{"parent_id":37,"points":[[3275,1600],[3400,1700]]}],"project_id":41,"difficulty":225,"duration":"about 14 days","rules":"You must have validated nm-otool","description":"Ce projet sur la programmation UNIX réseau vous invite à réaliser un client-serveur offrant des services identiques à IRC. Votre implémentation devra utiliser correctement select(2) pour gérer la connexion simultanée des clients, ainsi que des buffers tournants pour gérer les messages des clients.","slug":"irc"},{"id":21,"kind":"big_project","name":"Zappy","x":4300.0,"y":1600.0,"by":[{"parent_id":41,"points":[[3525,1600],[4300,1600]]},{"parent_id":41,"points":[[3400,1700],[3525,1600]]},{"parent_id":40,"points":[[3400,1500],[3525,1600]]},{"parent_id":40,"points":[[3525,1600],[4300,1600]]}],"project_id":43,"difficulty":600,"duration":"about 42 days","rules":"You must have finished quest(s) first-internship. You must have validated 1 of irc and ft_p","description":"Ce projet est l’aboutissement de vos précédents efforts en UNIX avancé : vous allez ici réaliser un jeu multi-joueurs en réseau TCP/IP. Ce jeu sera constitué d’un serveur gérant le terrain de jeu, d’un client graphique qui affiche l'état du plateau, et de clients IA qui se connectent sur le serveur pour piloter un joueur sur le terrain. C'est un projet très complet qui vous donne l'occasion d'exprimer votre créativité en plus de vos connaissances techniques !","slug":"zappy"},{"id":24,"kind":"big_project","name":"Gomoku","x":4475.0,"y":2575.0,"by":[{"parent_id":98,"points":[[4125,2775],[4275,2775]]},{"parent_id":97,"points":[[4275,2925],[4275,2775]]},{"parent_id":0,"points":[[4475,2575],[4272,2777]]}],"project_id":107,"difficulty":600,"duration":"about 28 days","rules":"You must have validated 1 of expert-system and n-puzzle","description":"Ce projet vous demande de créer, dans le langage de votre choix, un jeu de Gomoku intégrant un joueur IA capable de battre un joueur humain le plus rapidement possible. Pour ce faire, vous allez implémenter un algorithme min-max mais aussi (et surtout), faire des recherches et essais pour trouver les heuristiques les plus adaptées. Ce ne sera pas aussi facile qu'un jeu de dames.","slug":"gomoku"},{"id":27,"kind":"project","name":"Wolf3d","x":2898.0,"y":3678.0,"by":[{"parent_id":15,"points":[[3003,3444],[2898,3678]]}],"project_id":8,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of fract-ol, first-internship, and startup-internship","description":"Inspiré du célèbre jeu éponyme des années 90 qui fut le premier First Person Shooter, ce projet vous permet d'aborder la technique du ray-casting. Votre but sera de représenter une vue dynamique à l'intérieur d'un labyrinthe dans lequel on peut se déplacer.","slug":"wolf3d"},{"id":28,"kind":"project","name":"RTv1","x":3109.0,"y":3673.0,"by":[{"parent_id":15,"points":[[3003.5,3444.5],[3109,3673]]}],"project_id":23,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of fract-ol, first-internship, and startup-internship","description":"Découvrez les principes fondamentaux du Raytracing : la création d'images de synthèses par ordinateur. Ce premier projet vous fera réaliser des scènes simples impliquant des objets et des lumières non complexes.","slug":"rtv1"},{"id":30,"kind":"rush","name":"Rushes","x":2650.0,"y":3500.0,"by":[],"project_id":61,"difficulty":0,"duration":null,"rules":"","description":"Les rushes sont la formule idéale pour explorer des problématiques complémentaires aux projets réguliers de votre cursus, en immersion avec vos collègues. Le temps d'un week-end par exemple, vous allez vous concentrer sur un sujet précis, croiser de nouvelles têtes pour vos futurs projets, et adopter un rythme intensif ! Les thématiques vous seront communiquées à l'avance, vous n'aurez qu'à vous présenter le jour J avec énergie et bonne humeur pour relever les challenges que l'on vous propose.","slug":"rushes"},{"id":35,"kind":"project","name":"ft_ls","x":2999.0,"y":2800.0,"by":[{"parent_id":540,"points":[[3001,2793],[3002,3005]]}],"project_id":3,"difficulty":100,"duration":"about 7 days","rules":"You must have validated get_next_line and fillit","description":"Pour tout connaitre du filesystem, de la façon dont sont rangés les fichiers et répertoires, codez par vous-même une des commandes les plus utilisées : ls .","slug":"ft_ls"},{"id":38,"kind":"project","name":"ft_select","x":2800.0,"y":2450.0,"by":[{"parent_id":7,"points":[[2999,2591],[3000,2450]]},{"parent_id":7,"points":[[3000,2450],[2800,2450]]}],"project_id":33,"difficulty":100,"duration":"about 7 days","rules":"You must have validated 1 of minishell, first-internship, and startup-internship","description":"Ce projet a pour but de vous initier à la manipulation du terminal avec les termcaps. Vous allez ici apprendre à créer une interface utilisateur pour un programme lancé dans le terminal.","slug":"ft_select"},{"id":39,"kind":"project","name":"21sh","x":3000.0,"y":2350.0,"by":[{"parent_id":7,"points":[[3000,2550],[3000,2350]]}],"project_id":523,"difficulty":225,"duration":"about 14 days","rules":"You must not have validated ft_sh2 and ft_sh3. You must have validated 1 of minishell, first-internship, and startup-internship","description":"On passe aux choses sérieuses ! Avec 21sh, vous allez devoir écrire une implémentation proche de la réalité de la boucle read, eval, print d'un shell. A l'aide de la bibliothèque Termcaps, vous ajouterez une édition de ligne fonctionnelle et utile à la partie read de votre shell. Déplacements du curseur, édition, historique, multilignes, etc. Mais surtout pour la partie eval, oubliez la fonction ft_split que vous utilisiez dans votre Minishell pour découper la ligne de commande entrée par l'utilisateur !  21sh sera votre premier interprète réaliste, et en tant que tel, ce projet vous permettra de découvrir les analyses lexicale, syntaxique, et sémantique communes aux interprètes et aux compilateurs. Avec des structures de données et des traitements adaptées, ajouter la gestions des pipes (|) et des redirections (<, <<, >>. >) sera très simple !","slug":"21sh"},{"id":45,"kind":"project","name":"strace","x":2800.0,"y":1200.0,"by":[{"parent_id":79,"points":[[2800,1500],[2700,1400]]},{"parent_id":79,"points":[[2700,1400],[2700,1300]]},{"parent_id":79,"points":[[2700,1300],[2800,1200]]}],"project_id":179,"difficulty":225,"duration":"about 7 days","rules":"You must have validated libftasm","description":"Premier pas d'une série de projets en C menant à la réalisation d'un mini-GDB, ce projet vous demande de recoder strace, un outil qui permet de lister tous les appels systèmes effectués par un programme en cours d'exécution.","slug":"strace"},{"id":49,"kind":"project","name":"Abstract VM","x":2400.0,"y":4350.0,"by":[{"parent_id":62,"points":[[2400,4039],[2400,4350]]}],"project_id":80,"difficulty":225,"duration":"about 21 days","rules":"You must have validated piscine-cpp","description":"Ce projet vous remet dans le bain après la piscine C++ et vous invite à réaliser une machine virtuelle capable d'exécuter un code en pseudo-ASM basique. Vous allez ainsi utiliser une stack pour faire des opérations arithmétiques basiques, à l'instar de la commande dc.","slug":"abstract-vm"},{"id":50,"kind":"project","name":"Bomberman","x":2300.0,"y":4600.0,"by":[{"parent_id":80,"points":[[2300,4450],[2300,4600]]}],"project_id":410,"difficulty":375,"duration":"about 28 days","rules":"You must have validated abstract-vm. You must have finished quest(s) first-internship","description":"Bomberman, c'est un classique du jeu video : aussi simple dans son gameplay que fun à jouer ! Vous allez ici profiter de sa simplicité pour faire votre premier gros projet de C++ de facture professionnelle. Vous allez recoder une version de Bomberman, en C++ et avec OpenGL, avec pour objectif de réaliser un jeu le plus abouti possible.","slug":"bomberman"},{"id":59,"kind":"project","name":"Matcha","x":2500.0,"y":2500.0,"by":[{"parent_id":537,"points":[[2570,2570],[2500,2500]]}],"project_id":596,"difficulty":225,"duration":"about 0 days","rules":"You must have validated 1 of camagru, first-internship, and startup-internship","description":"Ce second projet vous introduit à un outil plus évolué pour réaliser vos applications web : le micro-framework. Nous vous invitons à réaliser, dans le langage de votre choix, un site de rencontres. Les interactions entre utilisateurs seront au coeur du projet !","slug":"matcha"},{"id":60,"kind":"big_project","name":"Hypertube","x":2370.0,"y":2370.0,"by":[{"parent_id":596,"points":[[2500,2500],[2370,2370]]}],"project_id":597,"difficulty":375,"duration":"about 28 days","rules":"You must have validated 1 of matcha, first-internship, and startup-internship","description":"Dernier projet de sa série, le projet Hypertube vous invite à découvrir une catégorie d'outil extrêmement puissante : les frameworks MVC. Vous apprendrez à manipuler un MVC, dans le langage de votre choix, pour réaliser un site de streaming de video téléchargées via le protocole BitTorrent.","slug":"hypertube"},{"id":99,"kind":"project","name":"ft_printf","x":3201.0,"y":3000.0,"by":[{"parent_id":540,"points":[[3201,3000],[3008.5,2999.5]]}],"project_id":5,"difficulty":100,"duration":"about 7 days","rules":"You must have validated 2 of fillit, get_next_line, first-internship, and startup-internship","description":"Vous en avez assez de faire vos affichages en alternant ft_putstr et ft_putnbr ? Vous n'avez pas le droit d'utiliser printf ? Recodez le votre ! Ce sera l'occasion de découvrir une feature du C - les fonctions variadiques - et de vous entrainer à la gestion fine des options d'affichage. Vous aurez ensuite le droit d'utiliser votre printf dans tous vos projets ultérieurs.","slug":"ft_printf"},{"id":101,"kind":"project","name":"Filler","x":3364.0,"y":2869.0,"by":[{"parent_id":5,"points":[[3201,3001],[3364,2869]]}],"project_id":26,"difficulty":100,"duration":"about 7 days","rules":"You must have validated 1 of ft_printf, first-internship, and startup-internship","description":"Créez votre joueur pour affronter d’autres étudiants sur le célèbre (ou pas) plateau du Filler. Le principe est simple : deux joueurs s’affrontent sur un plateau, et doivent placer, tour à tour, la pièce que le maître du jeu (fourni sous la forme d’un exécutable Ruby) leur donne, gagnant ainsi des points. La partie s’arrête dès qu’une pièce ne peut plus être placée. Petit projet ludique !","slug":"filler"},{"id":102,"kind":"project","name":"Push_swap","x":3365.0,"y":3142.0,"by":[{"parent_id":5,"points":[[3201,3001],[3365,3142]]}],"project_id":27,"difficulty":100,"duration":"about 7 days","rules":"You must have validated 1 of ft_printf, first-internship, and startup-internship","description":"Ce projet vous demande de trier des données sur une pile, avec un set d’instructions limité, en moins de coups possibles. Pour le réussir, vous devrez manipuler différents algorithmes de tri et choisir la (ou les ?) solution la plus appropriée pour un classement optimisé des données.","slug":"push_swap"},{"id":103,"kind":"project","name":"Lem_in","x":3533.0,"y":2999.0,"by":[{"parent_id":48,"points":[[3358,2770],[3533,2999]]},{"parent_id":22,"points":[[3533,2999],[3890.5,3000]]}],"project_id":29,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of push_swap, filler, first-internship, and startup-internship","description":"Votre colonie de fourmis doit se déplacer d'un point à un autre. Mais comment faire pour que cela prenne le moins de temps possible ? Ce projet vous fait découvrir les algorithmes de parcours de graphe : votre programme devra sélectionner intelligemment les chemins et les mouvements précis qui doivent être empruntés par ces fourmis.","slug":"lem_in"},{"id":107,"kind":"big_project","name":"42sh","x":3000.0,"y":2100.0,"by":[{"parent_id":523,"points":[[3000,2300],[3000,2100]]}],"project_id":35,"difficulty":375,"duration":"about 42 days","rules":"You must have validated 1 of 21sh, ft_sh3, first-internship, and startup-internship","description":"Ce projet consiste à créer de toutes pièces un shell complet, en reprenant le travail effectué sur votre 21sh. Un jeu minimum de fonctionnalités vous sont demandées, à partir duquel vous allez constuire votre propre shell abouti - en allant potentiellement jusqu'au job control et au shell script. Ce projet vous permet donc de voir ou revoir une très large palette des fonctionnalités UNIX (et POSIX) standard.","slug":"42sh"},{"id":113,"kind":"project","name":"init","x":2860.0,"y":3139.0,"by":[{"parent_id":540,"points":[[2861,3139],[3002,3001]]}],"project_id":687,"difficulty":100,"duration":"about 7 days","rules":"You must have validated 2 of get_next_line, fillit, first-internship, and startup-internship","description":"Ce projet est une introduction à l'administration système et au réseau, proposé par l'équipe slash16.","slug":"init"},{"id":118,"kind":"project","name":"roger-skyline-2","x":3566.0,"y":1974.0,"by":[{"parent_id":118,"points":[[3566,1974],[3448,2106]]}],"project_id":688,"difficulty":375,"duration":"about 60 days","rules":"You must have validated init. You must have finished quest(s) first-internship","description":"Ce projet proposé par slash16 vous donne la possibilité de monter votre propre infrastructure inspiré de celle de 42.","slug":"roger-skyline-2"},{"id":185,"kind":"project","name":"GET_Next_Line","x":2471.0,"y":2995.0,"by":[{"parent_id":1,"points":[[2471,2995],[2256,2996]]}],"project_id":2,"difficulty":100,"duration":"about 7 days","rules":"You must have validated libft","description":"Qu'il s'agisse d'un fichier, de l'entrée standard, ou même plus tard d'une connexion réseau, vous aurez toujours besoin de lire du contenu ligne par ligne. Il est donc temps de vous attaquer à cette fonction, indispensable pour un certain nombre de vos prochains projets.","slug":"get_next_line"},{"id":196,"kind":"project","name":"docker-1","x":2615.0,"y":3366.0,"by":[{"parent_id":1190,"points":[[2615,3366],[2755,3241]]}],"project_id":847,"difficulty":100,"duration":"about 7 days","rules":"You must have validated 1 of roger-skyline-1, first-internship, and startup-internship","description":"Premier projet sur l'écosystème Docker. Apprenez à réfléchir en containers à travers ce sujet, qui vous fera manipuler le binaire docker et créer vos premiers containers avec des Dockerfiles","slug":"docker-1"}]