[{"id":6,"kind":"exam","name":"C Exam Alone In The Dark - Beginner","x":2350.0,"y":3450.0,"by":[],"project_id":11,"difficulty":"Tier 1","duration":"about 1 week","rules":"","description":"Les examens machine permettent de vérifier vos acquis lorsque vous êtes seuls face à votre travail, sans vos peers et sans internet.\r\nPour valider ce projet (qui est un pré-requis à votre départ en 1er stage), il vous faut valider 5 examens avec une note minimum de 75.","slug":"c-exam-alone-in-the-dark-beginner"},{"id":25,"kind":"project","name":"FdF","x":3002.0,"y":3206.0,"by":[{"parent_id":2,"points":[[3002,3000],[3002.5,3206.5]]},{"parent_id":15,"points":[[3002.5,3206.5],[3003.5,3444.5]]}],"project_id":4,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated get_next_line","description":"Every programs you wrote until now were executing in text mode within your terminal.\r\nLet's discover something more interesting: how to open a graphic window and draw inside ?\r\nAs a way to start your journey to graphic programming land, Fdf offers you to draw the wireframe of a 3D landscape.\r\n","slug":"fdf"},{"id":30,"kind":"rush","name":"Rushes","x":2650.0,"y":3500.0,"by":[],"project_id":61,"difficulty":"Tier 0","duration":null,"rules":"","description":"Rushes are the best way to explore issues complementary to the regular projects of your curriculum, collaborating with your colleagues. Over the next few days, you will work intensively on a specific topic with a new teammate(s). Once notified, you have to be present on the D-day in a good mood to approach the proposed challenges in an enthusiastic manner. It's all about fun, after all!","slug":"rushes"},{"id":32,"kind":"first_internship","name":"First Internship","x":3000.0,"y":3000.0,"by":[{"parent_id":35,"points":[[3000,2100],[3000,2000]]},{"parent_id":22,"points":[[3900,3000],[4000,3000]]},{"parent_id":24,"points":[[3000,3900],[3000,4000]]},{"parent_id":597,"points":[[2292,2292],[2370,2370]]}],"project_id":118,"difficulty":"Tier 6","duration":"about 17 weeks","rules":"You must have validated 1 of hypertube, 42sh, corewar, and rt. You must have validated c-exam-alone-in-the-dark-beginner. You must have validated 1 of curriculum-vitae and savoir-relier. You must not have registered to entrepreneurship","description":"This first step in the company is an important part of your 42 course. This internship is the moment when you will discover the professional world and implement your work capacity, adaptation, serving the market. This is a first element for your resume, and the opportunity to see emerge your future field of predilection.\r\n","slug":"first-internship"},{"id":159,"kind":"piscine","name":"Piscine PHP","x":3400.0,"y":3100.0,"by":[{"parent_id":2,"points":[[3000,3000],[3400,3120]]}],"project_id":48,"difficulty":"Tier 1","duration":null,"rules":"","description":"La piscine PHP va vous permettre d'accéder aux technologies de base du web.","slug":"piscine-php"},{"id":162,"kind":"project","name":"Camagru","x":3700.0,"y":3000.0,"by":[{"parent_id":48,"points":[[3400,3100],[3700,3000]]},{"parent_id":727,"points":[[3400,2900],[3700,3000]]}],"project_id":537,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated 1 of piscine-php and piscine-python-django","description":"Ce premier projet vous remet dans le bain après la piscine PHP : vous allez devoir réaliser, en PHP, un petit site Instagram-like permettant à des utilisateurs de réaliser et partager des photo-montages. Vous allez ainsi implémenter, à mains nues (les frameworks sont interdits), les fonctionnalités de base rencontrées sur la majorité des sites possédant une base utilisateur.","slug":"camagru"},{"id":163,"kind":"project","name":"Matcha","x":3900.0,"y":3000.0,"by":[{"parent_id":537,"points":[[3700,3000],[3900,3000]]}],"project_id":596,"difficulty":"Tier 2","duration":"about 2 weeks","rules":"You must have validated camagru","description":"Ce second projet vous introduit à un outil plus évolué pour réaliser vos applications web : le micro-framework. Nous vous invitons à réaliser, dans le langage de votre choix, un site de rencontres. Les interactions entre utilisateurs seront au coeur du projet !","slug":"matcha"},{"id":164,"kind":"big_project","name":"Hypertube","x":4100.0,"y":3000.0,"by":[{"parent_id":596,"points":[[3900,3000],[4100,3000]]}],"project_id":597,"difficulty":"Tier 3","duration":"about 4 weeks","rules":"You must have validated matcha","description":"Dernier projet de sa série, le projet Hypertube vous invite à découvrir une catégorie d'outil extrêmement puissante : les frameworks MVC. Vous apprendrez à manipuler un MVC, dans le langage de votre choix, pour réaliser un site de streaming de video téléchargées via le protocole BitTorrent.","slug":"hypertube"},{"id":183,"kind":"project","name":"Libft","x":2550.0,"y":3000.0,"by":[{"parent_id":756,"points":[[2348,3001],[2550,3000]]}],"project_id":1,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated piscine-reloaded","description":"Ce premier projet en tant qu'étudiant de 42 va vous faire consolider vos acquis de piscine. Vous allez recoder un certain nombre de fonctions de la librairie C standard, ainsi que d'autres fonctions utilitaires que vous réutiliserez tout au long de votre cursus.","slug":"libft"},{"id":184,"kind":"project","name":"Fillit","x":2775.0,"y":3000.0,"by":[{"parent_id":1,"points":[[2550,3000],[2725,3000]]},{"parent_id":2,"points":[[2775,3000],[3005,2999]]}],"project_id":540,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated libft","description":"Fillit est un projet vous permettant de découvrir et/ou de vous familiariser avec une problématique récurrente en programmation : la recherche d'un solution optimale parmi un très grand nombre de possibilités, dans un délai raisonnable. Dans le cas de ce projet, il s'agira d'agencer des Tetriminos entre eux et de déterminer le plus petit carré possible pouvant les accueillir.","slug":"fillit"},{"id":185,"kind":"project","name":"Get_Next_Line","x":3002.0,"y":3000.0,"by":[{"parent_id":687,"points":[[3002,3000],[2850,3149]]}],"project_id":2,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated fillit","description":"Qu'il s'agisse d'un fichier, de l'entrée standard, ou même plus tard d'une connexion réseau, vous aurez toujours besoin de lire du contenu ligne par ligne. Il est donc temps de vous attaquer à cette fonction, indispensable pour un certain nombre de vos prochains projets.","slug":"get_next_line"}]