[{"id":30,"kind":"rush","name":"Rushes","x":2650.0,"y":3500.0,"by":[],"project_id":61,"difficulty":0,"duration":null,"rules":"","description":"Les rushes sont la formule idéale pour explorer des problématiques complémentaires aux projets réguliers de votre cursus, en immersion avec vos collègues. Le temps d'un week-end par exemple, vous allez vous concentrer sur un sujet précis, croiser de nouvelles têtes pour vos futurs projets, et adopter un rythme intensif ! Les thématiques vous seront communiquées à l'avance, vous n'aurez qu'à vous présenter le jour J avec énergie et bonne humeur pour relever les challenges que l'on vous propose.","slug":"rushes"},{"id":235,"kind":"project","name":"Curriculum Vitae","x":3500.0,"y":3400.0,"by":[],"project_id":902,"difficulty":25,"duration":"about 0 days","rules":"You must be at least level 5 in cursus 42","description":"Tout aussi créatif, atypique, ou particulier que vous puissiez être, il existe certains codes sociaux dans le monde du travail que vous ne pourrez que difficilement contourner, tout du moins dans l’immédiat. Votre intégration professionnelle figurant en bonne place dans les objectifs de l’école, il est naturel que nous vous intéressions à cette porte d’entrée (parmi d’autres) que constitue l’établissement de votre CV.","slug":"curriculum-vitae"},{"id":624,"kind":"project","name":"Blackhole - Peer Helper","x":3400.0,"y":3525.0,"by":[],"project_id":1227,"difficulty":0,"duration":null,"rules":"","description":"","slug":"blackhole-peer-helper"},{"id":1041,"kind":"big_project","name":"42sh","x":3000.0,"y":2100.0,"by":[{"parent_id":523,"points":[[3000,2300],[3000,2100]]}],"project_id":35,"difficulty":275,"duration":"about 42 days","rules":"You must have validated 1 of 21sh, first-internship, ft_sh3, and startup-internship","description":"Ce projet consiste à créer de toutes pièces un shell complet, en reprenant le travail effectué sur votre 21sh. Un jeu minimum de fonctionnalités vous sont demandées, à partir duquel vous allez constuire votre propre shell abouti - en allant potentiellement jusqu'au job control et au shell script. Ce projet vous permet donc de voir ou revoir une très large palette des fonctionnalités UNIX (et POSIX) standard.","slug":"42sh"},{"id":1042,"kind":"project","name":"Taskmaster","x":3200.0,"y":2200.0,"by":[{"parent_id":523,"points":[[3000,2350],[3000,2200]]},{"parent_id":523,"points":[[3000,2200],[3200,2200]]}],"project_id":122,"difficulty":100,"duration":"about 14 days","rules":"You must have validated 1 of 21sh and first-internship","description":"Il s'agit de réaliser un programme de job control, dans le langage de votre choix. Ce qu'on vous demandera d'accomplir est très proche du programme supervisor","slug":"taskmaster"},{"id":1043,"kind":"project","name":"21sh","x":3000.0,"y":2350.0,"by":[{"parent_id":7,"points":[[3000,2550],[3000,2350]]}],"project_id":523,"difficulty":375,"duration":"about 14 days","rules":"You must have validated 1 of minishell, first-internship, and startup-internship","description":"On passe aux choses sérieuses ! Avec 21sh, vous allez devoir écrire une implémentation proche de la réalité de la boucle read, eval, print d'un shell. A l'aide de la bibliothèque Termcaps, vous ajouterez une édition de ligne fonctionnelle et utile à la partie read de votre shell. Déplacements du curseur, édition, historique, multilignes, etc. Mais surtout pour la partie eval, oubliez la fonction ft_split que vous utilisiez dans votre Minishell pour découper la ligne de commande entrée par l'utilisateur !  21sh sera votre premier interprète réaliste, et en tant que tel, ce projet vous permettra de découvrir les analyses lexicale, syntaxique, et sémantique communes aux interprètes et aux compilateurs. Avec des structures de données et des traitements adaptées, ajouter la gestions des pipes (|) et des redirections (<, <<, >>. >) sera très simple !","slug":"21sh"},{"id":1044,"kind":"project","name":"ft_ls","x":2999.0,"y":2800.0,"by":[{"parent_id":540,"points":[[3001,2793],[3002,3005]]}],"project_id":3,"difficulty":150,"duration":"about 7 days","rules":"You must have validated get_next_line and fillit","description":"Pour tout connaitre du filesystem, de la façon dont sont rangés les fichiers et répertoires, codez par vous-même une des commandes les plus utilisées : ls .","slug":"ft_ls"},{"id":1045,"kind":"project","name":"ft_printf","x":3201.0,"y":3000.0,"by":[{"parent_id":540,"points":[[3201,3000],[3008,2999]]}],"project_id":5,"difficulty":150,"duration":"about 7 days","rules":"You must have validated 2 of fillit, get_next_line, first-internship, and startup-internship","description":"Vous en avez assez de faire vos affichages en alternant ft_putstr et ft_putnbr ? Vous n'avez pas le droit d'utiliser printf ? Recodez le votre ! Ce sera l'occasion de découvrir une feature du C - les fonctions variadiques - et de vous entrainer à la gestion fine des options d'affichage. Vous aurez ensuite le droit d'utiliser votre printf dans tous vos projets ultérieurs.","slug":"ft_printf"},{"id":1046,"kind":"project","name":"Lem_in","x":3533.0,"y":2999.0,"by":[{"parent_id":727,"points":[[3334,2828],[3533,2999]]},{"parent_id":48,"points":[[3348,3168],[3533,2999]]},{"parent_id":22,"points":[[3533,2999],[3895,3000]]}],"project_id":29,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of push_swap, filler, first-internship, and startup-internship","description":"Votre colonie de fourmis doit se déplacer d'un point à un autre. Mais comment faire pour que cela prenne le moins de temps possible ? Ce projet vous fait découvrir les algorithmes de parcours de graphe : votre programme devra sélectionner intelligemment les chemins et les mouvements précis qui doivent être empruntés par ces fourmis.","slug":"lem_in"},{"id":1047,"kind":"project","name":"mod1","x":3750.0,"y":3250.0,"by":[{"parent_id":29,"points":[[3533,2999],[3750,3000]]},{"parent_id":29,"points":[[3750,3000],[3750,3250]]}],"project_id":78,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of lem_in, first-internship, and startup-internship","description":"Ce projet graphique de simulation vous fera représenter une surface en 3D, sur laquelle s'écoule de l'eau. Empirique, ou scientifique (avec nombre équations), recréez une vague, un tsunami, ou simplement de la pluie sur votre surface.","slug":"mod1"},{"id":1048,"kind":"big_project","name":"Corewar","x":3895.0,"y":3000.0,"by":[],"project_id":22,"difficulty":375,"duration":"about 0 days","rules":"You must have validated 1 of lem_in, first-internship, and startup-internship","description":"Ce projet vous invite à créer une arène virtuelle et à y faire s’affronter des programmes codés dans un langage simpliste. Vous allez ainsi aborder la conception d’une VM (avec les instructions qu’elle reconnait, les registres, etc), et les problématiques de compilation d’un langage assembleur en bytecode. Avec, en bonus, le plaisir de faire s’affronter vos champions sur votre arène !","slug":"corewar"},{"id":1049,"kind":"project","name":"FdF","x":3002.0,"y":3206.0,"by":[{"parent_id":15,"points":[[3002,3206],[3003,3444]]},{"parent_id":540,"points":[[3002,3206],[3002,3001]]}],"project_id":4,"difficulty":100,"duration":"about 7 days","rules":"You must have validated get_next_line and fillit","description":"Tous les programmes que vous avez écris jusqu'à maintenant s'exécutaient uniquement en mode texte dans votre terminal. Découvrons maintenant quelque chose de plus excitant : comment ouvrir une fenêtre graphique et dessiner dedans ? Pour commencer votre voyage au pays de la programmation graphique, FdF vous propose de représenter le maillage en fils de fer d'un terrain en 3D.","slug":"fdf"},{"id":1050,"kind":"project","name":"GUImp","x":3196.0,"y":3441.0,"by":[{"parent_id":15,"points":[[3196,3441],[3003,3440]]}],"project_id":1117,"difficulty":225,"duration":"about 21 days","rules":"You must have validated 1 of fract-ol, first-internship, and startup-internship","description":"L'objectif de ce projet sera pour vous de réaliser une librairie d'interface graphique. Vous devrez prouver son bon fonctionnement avec un petit logiciel d'édition d'image 2D. Cette librairie devra être la plus complète et modulable possible, l'objectif étant de la réutiliser dans vos futurs projets, que ce soit pour vos projets de la branche graphique ou vos autres projets du cursus.","slug":"guimp"},{"id":1051,"kind":"project","name":"Wolf3d","x":2898.0,"y":3678.0,"by":[{"parent_id":15,"points":[[3003,3444],[2898,3678]]}],"project_id":8,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of fract-ol, first-internship, and startup-internship","description":"Inspiré du célèbre jeu éponyme des années 90 qui fut le premier First Person Shooter, ce projet vous permet d'aborder la technique du ray-casting. Votre but sera de représenter une vue dynamique à l'intérieur d'un labyrinthe dans lequel on peut se déplacer.","slug":"wolf3d"},{"id":1052,"kind":"project","name":"RTv1","x":3105.29,"y":3671.15,"by":[{"parent_id":15,"points":[[3003,3444],[3109,3673]]}],"project_id":23,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of fract-ol, first-internship, and startup-internship","description":"Découvrez les principes fondamentaux du Raytracing : la création d'images de synthèses par ordinateur. Ce premier projet vous fera réaliser des scènes simples impliquant des objets et des lumières non complexes.","slug":"rtv1"},{"id":1059,"kind":"project","name":"Piscine Reloaded","x":2350.0,"y":3000.0,"by":[],"project_id":756,"difficulty":30,"duration":"about 2 days","rules":"","description":"Revoyez les bases de la piscine avec une suite d'exercices tirée des sujets de celle-ci.","slug":"piscine-reloaded"},{"id":1060,"kind":"project","name":"GET_Next_Line","x":2792.0,"y":3001.0,"by":[{"parent_id":1,"points":[[2792,3001],[2552,2999]]}],"project_id":2,"difficulty":100,"duration":"about 7 days","rules":"You must have validated libft","description":"Qu'il s'agisse d'un fichier, de l'entrée standard, ou même plus tard d'une connexion réseau, vous aurez toujours besoin de lire du contenu ligne par ligne. Il est donc temps de vous attaquer à cette fonction, indispensable pour un certain nombre de vos prochains projets.","slug":"get_next_line"},{"id":1061,"kind":"project","name":"Libft","x":2550.0,"y":3000.0,"by":[{"parent_id":756,"points":[[2348,3001],[2550,3000]]}],"project_id":1,"difficulty":85,"duration":"about 7 days","rules":"You must have validated piscine-reloaded","description":"Ce premier projet en tant qu'étudiant de 42 va vous faire consolider vos acquis de piscine. Vous allez recoder un certain nombre de fonctions de la librairie C standard, ainsi que d'autres fonctions utilitaires que vous réutiliserez tout au long de votre cursus.","slug":"libft"},{"id":1062,"kind":"project","name":"Fillit","x":3002.0,"y":3001.0,"by":[{"parent_id":2,"points":[[3002,3001],[2796,3002]]}],"project_id":540,"difficulty":100,"duration":"about 7 days","rules":"You must have validated get_next_line","description":"Fillit est un projet vous permettant de decouvrir et/ou de vous familiariser avec une problematique recurrente en programmation : la recherche d'un solution optimale parmis un tres grand nombre de possibilites, dans un delais raisonable. Dans le cas de ce projet, il s'agira d'agencer des Tetriminos entre eux et de determiner le plus petit carre possible pouvant les accuellir.","slug":"fillit"},{"id":1064,"kind":"project","name":"roger-skyline-1","x":2755.0,"y":3240.0,"by":[{"parent_id":687,"points":[[2755,3241],[2861,3139]]}],"project_id":1190,"difficulty":85,"duration":"about 0 days","rules":"You must have validated 1 of init, first-internship, and startup-internship","description":"This subject follows Init where you have learn some of basics commands and first reflexes in system and network administration. \r\nThis one will be a concrete example of the use of those commands and will let you start your own first web server.","slug":"roger-skyline-1"},{"id":1065,"kind":"project","name":"docker-1","x":2626.48,"y":3350.05,"by":[{"parent_id":1190,"points":[[2638,3349],[2755,3241]]}],"project_id":847,"difficulty":100,"duration":"about 7 days","rules":"You must have validated 1 of roger-skyline-1, first-internship, and startup-internship","description":"Premier projet sur l'écosystème Docker. Apprenez à réfléchir en containers à travers ce sujet, qui vous fera manipuler le binaire docker et créer vos premiers containers avec des Dockerfiles","slug":"docker-1"},{"id":1066,"kind":"project","name":"Fract'ol","x":3003.0,"y":3444.0,"by":[],"project_id":15,"difficulty":100,"duration":"about 7 days","rules":"You must have validated 1 of fdf, first-internship, and startup-internship","description":"Découvrez la programmation 2D et l'univers psychédelique des fractales grâce à ce projet à réaliser avec la minilibX.","slug":"fract-ol"},{"id":1067,"kind":"big_project","name":"RT","x":3111.0,"y":3893.0,"by":[{"parent_id":23,"points":[[3109,3673],[3111,3893]]}],"project_id":24,"difficulty":375,"duration":"about 42 days","rules":"You must have validated 1 of rtv1, first-internship, and startup-internship","description":"Passez à la vitesse supérieure ! Suite du Rtv1, le RT pousse beaucoup plus loin les possibilités du Raytracing : effet miroir, transparence, découpe des objets, applications de textures... Capitalisez sur le projet précédent pour réaliser une infrastructure capable de supporter toutes ces ramifications et obtenir de sublimes images de synthèse.","slug":"rt"},{"id":1068,"kind":"first_internship","name":"First Internship","x":3000.0,"y":3000.0,"by":[{"parent_id":22,"points":[[3961,3000],[3999,3000]]},{"parent_id":24,"points":[[3109,3934],[3109,3993]]},{"parent_id":1182,"points":[[2893,3898],[2892,3994]]},{"parent_id":597,"points":[[2092,2860],[2010,2860]]},{"parent_id":35,"points":[[3001,2058],[3000,2000]]}],"project_id":118,"difficulty":1000,"duration":"about 120 days","rules":"You must have validated roger-skyline-1. You must have finished quest(s) start-condition. You must not have registered to startup-internship","description":"Ce premier pas en entreprise est un passage important de votre cursus 42. Ce stage est le moment où vous allez découvrir le monde de l'entreprise et mettre en oeuvre vos capacités de travail, d'adaptation, au service du marché. C'est un premier élément pour votre CV, et l'occasion de voir émerger votre futur domaine de prédilection.","slug":"first-internship"},{"id":1069,"kind":"project","name":"Push_swap","x":3365.0,"y":3142.0,"by":[{"parent_id":5,"points":[[3201,3001],[3365,3142]]}],"project_id":27,"difficulty":150,"duration":"about 7 days","rules":"You must have validated 1 of ft_printf, first-internship, and startup-internship","description":"Ce projet vous demande de trier des données sur une pile, avec un set d’instructions limité, en moins de coups possibles. Pour le réussir, vous devrez manipuler différents algorithmes de tri et choisir la (ou les ?) solution la plus appropriée pour un classement optimisé des données.","slug":"push_swap"},{"id":1070,"kind":"project","name":"Filler","x":3364.0,"y":2869.0,"by":[{"parent_id":5,"points":[[3201,3001],[3364,2869]]}],"project_id":26,"difficulty":100,"duration":"about 7 days","rules":"You must have validated 1 of ft_printf, first-internship, and startup-internship","description":"Créez votre joueur pour affronter d’autres étudiants sur le célèbre (ou pas) plateau du Filler. Le principe est simple : deux joueurs s’affrontent sur un plateau, et doivent placer, tour à tour, la pièce que le maître du jeu (fourni sous la forme d’un exécutable Ruby) leur donne, gagnant ainsi des points. La partie s’arrête dès qu’une pièce ne peut plus être placée. Petit projet ludique !","slug":"filler"},{"id":1071,"kind":"project","name":"minishell","x":3000.0,"y":2600.0,"by":[{"parent_id":3,"points":[[2999,2801],[3000,2593]]}],"project_id":7,"difficulty":150,"duration":"about 7 days","rules":"You must have validated 1 of ft_ls, first-internship, and startup-internship","description":"Première étape de la réalisation d'un shell. Dans ce projet, vous devez réaliser un mini-shell capable de lire et d'évaluer des commandes simples de l'utilisateur. La lecture impliquera une analyse lexicale et syntaxique triviale de la commande, et l'évaluation impliquera de rechercher le binaire correspondant sur la machine et l'exécuter, ou bien d'exécuter le code concerné dans le cas d'une commande built-in au shell.","slug":"minishell"},{"id":1072,"kind":"exam","name":"C Exam Alone In The Dark - Beginner","x":2334.6,"y":3508.35,"by":[],"project_id":11,"difficulty":100,"duration":null,"rules":"","description":"Les examens machine permettent de vérifier vos acquis lorsque vous êtes seuls face à votre travail, sans vos peers et sans internet. Pour valider ce projet (qui est un pré-requis à votre départ en 1er stage), il vous faut valider 5 examens avec une note minimum de 75.","slug":"c-exam-alone-in-the-dark-beginner"},{"id":1073,"kind":"big_project","name":"Hypertube","x":2109.98,"y":2851.8,"by":[{"parent_id":596,"points":[[2303,2713],[2108,2868]]}],"project_id":597,"difficulty":275,"duration":"about 28 days","rules":"You must have validated 1 of matcha, first-internship, and startup-internship","description":"Dernier projet de sa série, le projet Hypertube vous invite à découvrir une catégorie d'outil extrêmement puissante : les frameworks MVC. Vous apprendrez à manipuler un MVC, dans le langage de votre choix, pour réaliser un site de streaming de video téléchargées via le protocole BitTorrent.","slug":"hypertube"},{"id":1074,"kind":"project","name":"init","x":2860.0,"y":3139.0,"by":[{"parent_id":540,"points":[[2861,3139],[3002,3001]]}],"project_id":687,"difficulty":30,"duration":"about 7 days","rules":"You must have validated 2 of get_next_line, fillit, first-internship, and startup-internship","description":"Ce projet est une introduction à l'administration système et au réseau, proposé par l'équipe slash16.","slug":"init"},{"id":1075,"kind":"big_project","name":"Doom Nukem","x":2896.0,"y":3893.0,"by":[{"parent_id":8,"points":[[2898,3679],[2896,3893]]}],"project_id":1182,"difficulty":375,"duration":"about 42 days","rules":"You must have validated 1 of wolf3d, first-internship, and startup-internship","description":"Passez à la vitesse supérieure ! Suite du Wolf3D, le Doom Nukem pousse beaucoup plus loin les possibilités du Raycasting tout en y apportant une dimension de Game design, vous allez donc devoir réaliser un vrai jeu et pour cela c’est un mélange de Doom et de Duke Nukem 3D qu’il vous faudra réaliser ! De nombreux éléments fonctionnels de base sont identiques. Ils n’ont cependant pas été implémentés de la même façon par les concepteurs des deux jeux. A vous de trouver celle qui vous conviendra et qui vous permettra d’ajouter les features demandées comme celles que vous souhaitez y voir.","slug":"doom-nukem"},{"id":1076,"kind":"project","name":"Camagru","x":2456.1,"y":2720.26,"by":[{"parent_id":48,"points":[[2649,2716],[2451,2716]]}],"project_id":537,"difficulty":150,"duration":"about 0 days","rules":"You must have validated 1 of piscine-php, first-internship, and startup-internship","description":"Ce premier projet vous remet dans le bain après la piscine PHP : vous allez devoir réaliser, en PHP, un petit site Instagram-like permettant à des utilisateurs de réaliser et partager des photo-montages. Vous allez ainsi implémenter, à mains nues (les frameworks sont interdits), les fonctionnalités de base rencontrées sur la majorité des sites possédant une base utilisateur.","slug":"camagru"},{"id":1077,"kind":"piscine","name":"Piscine PHP","x":2657.22,"y":2718.53,"by":[],"project_id":48,"difficulty":150,"duration":null,"rules":"You must have validated 1 of fdf, ft_printf, ft_ls, and docker-1","description":"La piscine PHP va vous permettre d'accéder aux technologies de base du web.","slug":"piscine-php"},{"id":1102,"kind":"project","name":"Matcha","x":2298.32,"y":2718.53,"by":[{"parent_id":537,"points":[[2457,2718],[2312,2717]]}],"project_id":596,"difficulty":225,"duration":"about 0 days","rules":"You must have validated 1 of camagru, first-internship, and startup-internship","description":"Ce second projet vous introduit à un outil plus évolué pour réaliser vos applications web : le micro-framework. Nous vous invitons à réaliser, dans le langage de votre choix, un site de rencontres. Les interactions entre utilisateurs seront au coeur du projet !","slug":"matcha"},{"id":1103,"kind":"project","name":"ft_select","x":2800.0,"y":2450.0,"by":[{"parent_id":7,"points":[[2999,2591],[3000,2450]]},{"parent_id":7,"points":[[3000,2450],[2800,2450]]}],"project_id":33,"difficulty":100,"duration":"about 7 days","rules":"You must have validated 1 of minishell, first-internship, and startup-internship","description":"Ce projet a pour but de vous initier à la manipulation du terminal avec les termcaps. Vous allez ici apprendre à créer une interface utilisateur pour un programme lancé dans le terminal.","slug":"ft_select"},{"id":5317,"kind":"project","name":"Scop","x":3001.87,"y":4103.05,"by":[{"parent_id":118,"points":[[3000,4000],[3001,4103]]}],"project_id":135,"difficulty":225,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"Faites vos premiers pas dans le monde de la 3D sur GPU avec de l'OpenGL. Les principaux concepts sont abordés lors d'un petit projet ludique.","slug":"scop"},{"id":5319,"kind":"big_project","name":"Startup-Internship","x":3883.51,"y":3447.22,"by":[],"project_id":1055,"difficulty":1000,"duration":"about 120 days","rules":"You must have validated roger-skyline-1. You must not have registered to first-internship. You must have finished quest(s) start-condition","description":"Ce premier pas en entreprise est un passage important de votre cursus 42. Ce projet est une alternative au stage pour ceux d'entre vous qui ont une âme d'entrepreneur, mais ne vous y engagez pas à la légère : il est très exigeant, et ne peut en aucun cas être une excuse pour éviter de trouver un stage. Seuls les projets entrepreneuriaux concrets, solides et sérieux seront acceptés.","slug":"startup-internship"},{"id":6028,"kind":"project","name":"Expert System","x":4375.33,"y":3112.89,"by":[{"parent_id":534,"points":[[4238,3002],[4373,3116]]}],"project_id":98,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of startup-internship and first-internship. You must have validated rubik","description":"Ce projet vous demande de créer, dans le langage de votre choix, un système expert en calcul des propositions, autrement dit un programme capable de raisonner sur un ensemble de règles et de faits initiaux afin de déduire certains autres faits.","slug":"expert-system"},{"id":6031,"kind":"project","name":"Malloc","x":3000.66,"y":1902.13,"by":[{"parent_id":118,"points":[[3000,2000],[3000,1900]]}],"project_id":36,"difficulty":225,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"Que se cache derriere malloc ? Vous l'utilisez depuis la piscine C, mais ce n'est pas un appel système. Découvrez les rouages d'une gestion optimum de la mémoire, et recodez-le, ainsi que free et realloc.","slug":"malloc"},{"id":6037,"kind":"project","name":"Boot2Root","x":1835.5,"y":2576.74,"by":[{"parent_id":603,"points":[[1912,2464],[1835,2579]]}],"project_id":909,"difficulty":375,"duration":null,"rules":"You must have validated snow-crash. You must have validated 1 of startup-internship and first-internship","description":"Challenge Securité : Cherchez en groupe les différents moyens de passer root sur l'ISO fournie en ressources.","slug":"boot2root"},{"id":6057,"kind":"project","name":"ComputorV1","x":4091.16,"y":3299.44,"by":[{"parent_id":118,"points":[[3967,3261],[4092,3301]]}],"project_id":111,"difficulty":100,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"Le but de ce projet est de vous faire (re)prendre contact avec la manipulation d’outils mathématiques élémentaires, qui pourront vous être utiles dans de nombreux autres sujets de 42. Il ne s’agit pas de faire des maths pour faire des maths, mais bien de vous permettre d’aborder plus progressivement et sereinement les sujets où il y en a besoin. Vous êtes libres dans le choix de langage pour réaliser le sujet.","slug":"computorv1"},{"id":6058,"kind":"project","name":"N-puzzle","x":4118.19,"y":3123.79,"by":[{"parent_id":118,"points":[[4119,3006],[4119,3107]]}],"project_id":97,"difficulty":225,"duration":"about 14 days","rules":"You must have finished quest(s) start-condition","description":"Il s'agit ici de réaliser, dans le langage de votre choix, un programme capable de résoudre des Taquins de tailles variées, de façon aussi optimale que possible.","slug":"n-puzzle"},{"id":6059,"kind":"project","name":"Lem-ipc","x":3002.19,"y":1713.83,"by":[{"parent_id":36,"points":[[3001,1902],[3002,1705]]}],"project_id":42,"difficulty":225,"duration":"about 14 days","rules":"You must have validated malloc. You must have validated 1 of startup-internship and first-internship","description":"Vous avez vu précédemment la communication entre processus sur le réseau, via TCP/IP","slug":"lem-ipc"},{"id":6061,"kind":"project","name":"XV","x":3336.8,"y":4049.28,"by":[{"parent_id":118,"points":[[3301,3956],[3332,4040]]}],"project_id":677,"difficulty":375,"duration":"about 56 days","rules":"You must have finished quest(s) start-condition","description":"Ce projet vous est proposé par l'entreprise Daher et a pour but de vous faire développer une interface graphique sous Unity à des fin d'optimisation de processus industriels.","slug":"xv"},{"id":6062,"kind":"project","name":"In the Shadows","x":3453.47,"y":4002.61,"by":[{"parent_id":118,"points":[[3401,3918],[3454,4010]]}],"project_id":678,"difficulty":225,"duration":"about 21 days","rules":"You must have finished quest(s) start-condition","description":"Ce projet a pour but de vous faire développer un jeu complet nécessitant un peu d'algo et beaucoup de créativité.","slug":"in-the-shadows"},{"id":6063,"kind":"project","name":"42run","x":3109.43,"y":4217.03,"by":[{"parent_id":135,"points":[[3006,4108],[3105,4221]]}],"project_id":178,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of startup-internship and first-internship. You must have validated scop","description":"Vous connaissez Temple Run ? Il est temps de le refaire ! Ce projet intermédiaire d'OpenGL vous invite à recréer ce jeu mobile. Amusez-vous : tous les bonus sont possible pour dépasser la célèbre franchise.","slug":"42run"},{"id":6064,"kind":"project","name":"HumanGL","x":3000.26,"y":4337.43,"by":[{"parent_id":135,"points":[[3001,4101],[3000,4335]]}],"project_id":535,"difficulty":100,"duration":"about 7 days","rules":"You must have validated scop. You must have validated 1 of startup-internship and first-internship","description":"Ce projet intermédiaire d'OpenGL est une introduction à la modélisation hiérarchique. Vous allez apprendre à utiliser les matrices afin de lier différentes parties d’un modèle humanoïde et les animer.","slug":"humangl"},{"id":6065,"kind":"project","name":"Particle System","x":3157.26,"y":4442.53,"by":[{"parent_id":535,"points":[[3007,4334],[3132,4427]]}],"project_id":679,"difficulty":225,"duration":null,"rules":"You must have validated humangl","description":"Ce projet d’infographie est une introduction au monde merveilleux du GPU. Via l’utilisation d’OpenGL et d’OpenCL, permettant une parallélisation massive des calculs, vous devrez créer un système de particules tout en respectant les contraintes de performance imposées.","slug":"particle-system"},{"id":6066,"kind":"project","name":"ft_vox","x":2905.54,"y":4220.24,"by":[{"parent_id":135,"points":[[3000,4108],[2910,4222]]}],"project_id":978,"difficulty":375,"duration":"about 21 days","rules":"You must have validated scop. You must have validated 1 of startup-internship and first-internship","description":"ft_vox est un projet d'introduction au moteur de voxel, inspiré de minecraft, dans lequel vous devez créer un monde généré aléatoirement.","slug":"ft_vox"},{"id":6067,"kind":"project","name":"ShaderPixel","x":2942.47,"y":4549.35,"by":[{"parent_id":535,"points":[[3001,4332],[2946,4544]]}],"project_id":1087,"difficulty":375,"duration":"about 21 days","rules":"You must have validated humangl","description":"Maintenant que vous êtes à l'aise avec les objets 3D et les techniques basiques de rendu, on va parler sérieux et travailler réellement dans l'espace de la carte graphique. A vous de composer et créer les objets les plus déments grâce à la programmation de shaders.","slug":"shaderpixel"},{"id":6068,"kind":"project","name":"ft_newton42","x":3061.89,"y":4550.01,"by":[{"parent_id":535,"points":[[3002,4331],[3061,4550]]}],"project_id":2113,"difficulty":375,"duration":"about 14 days","rules":"You must have validated humangl","description":" basic Physics engine - motion - gravity - collisions ","slug":"ft_newton42"},{"id":6069,"kind":"project","name":"Bomberman","x":2865.41,"y":4441.78,"by":[{"parent_id":535,"points":[[3001,4332],[2873,4438]]}],"project_id":410,"difficulty":375,"duration":"about 28 days","rules":"You must have validated humangl","description":"Bomberman, c'est un classique du jeu video : aussi simple dans son gameplay que fun à jouer ! Vous allez ici profiter de sa simplicité pour faire votre premier gros projet de C++ de facture professionnelle. Vous allez recoder une version de Bomberman, en C++ et avec OpenGL, avec pour objectif de réaliser un jeu le plus abouti possible.","slug":"bomberman"},{"id":6070,"kind":"project","name":"ft_ssl_md5","x":3664.81,"y":2116.33,"by":[{"parent_id":118,"points":[[3594,2196],[3668,2118]]}],"project_id":2112,"difficulty":220,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"You will recode part of the OpenSSL program, specifically the MD5 Hashing Algorithm.","slug":"ft_ssl_md5"},{"id":6071,"kind":"project","name":"ft_ality","x":3608.75,"y":4067.93,"by":[{"parent_id":601,"points":[[3608,3936],[3604,4063]]}],"project_id":665,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of startup-internship and first-internship. You must have validated ft_turing","description":"Ce projet va vous initier aux problématiques liées à l'analyse syntaxique automatique (dite parsing), en étudiant les automates finis avec un jeu de combat.","slug":"ft_ality"},{"id":6073,"kind":"project","name":"42_matrix","x":2062.77,"y":3617.48,"by":[{"parent_id":118,"points":[[2166,3553],[2076,3612]]}],"project_id":2115,"difficulty":225,"duration":null,"rules":"You must have finished quest(s) start-condition","description":"","slug":"42_matrix"},{"id":6074,"kind":"project","name":"42 Ready Set boole","x":1992.52,"y":3494.77,"by":[{"parent_id":118,"points":[[2102,3444],[1992,3501]]}],"project_id":2116,"difficulty":225,"duration":null,"rules":"You must have finished quest(s) start-condition","description":"","slug":"42-ready-set-boole"},{"id":6075,"kind":"project","name":"ft_malcolm_42","x":1916.64,"y":3239.98,"by":[{"parent_id":118,"points":[[2024,3218],[1961,3235]]}],"project_id":2117,"difficulty":225,"duration":null,"rules":"You must have finished quest(s) start-condition","description":"","slug":"ft_malcolm_42"},{"id":6076,"kind":"project","name":"42_ft_shield","x":2004.18,"y":2225.05,"by":[{"parent_id":701,"points":[[2195,2194],[2009,2228]]}],"project_id":2118,"difficulty":375,"duration":null,"rules":"You must have validated 1 of startup-internship and first-internship. You must have validated woody-woodpacker","description":"","slug":"42_ft_shield"},{"id":6077,"kind":"big_project","name":"Open Project I","x":4147.39,"y":3765.88,"by":[{"parent_id":118,"points":[[3406,3913],[3450,4050]]}],"project_id":85,"difficulty":600,"duration":null,"rules":"You must have finished quest(s) first-internship","description":"","slug":"open-project-i"},{"id":6078,"kind":"project","name":"ft_turing","x":3618.34,"y":3939.13,"by":[{"parent_id":118,"points":[[3536,3847],[3588,3917]]}],"project_id":601,"difficulty":225,"duration":"about 14 days","rules":"You must have finished quest(s) start-condition","description":"ft_turing vous fera découvrir le modèle de Turing à la base du paradigme impératif à travers une implémentation de ce modèle en OCaml.","slug":"ft_turing"},{"id":6079,"kind":"project","name":"H42N42","x":3736.07,"y":3979.75,"by":[{"parent_id":601,"points":[[3602,3934],[3737,3973]]}],"project_id":819,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of startup-internship and first-internship. You must have validated ft_turing","description":"Projet d'introduction au Framework OCSIGEN, permettant de créer des applications web riches en OCaml. Concevez un simulateur de Bestioles échappant à un dangereux virus !","slug":"h42n42"},{"id":6080,"kind":"project","name":"Nibbler","x":2547.62,"y":4217.27,"by":[{"parent_id":80,"points":[[2614,4084],[2552,4219]]}],"project_id":95,"difficulty":225,"duration":"about 14 days","rules":"You must have validated ft_abstract_vm. You must have validated 1 of startup-internship and first-internship","description":"Ce projet de C++ vous fait recoder le jeu Snake avec plusieurs interfaces graphiques différentes","slug":"nibbler"},{"id":6081,"kind":"project","name":"Swifty Companion","x":2215.65,"y":3833.27,"by":[{"parent_id":118,"points":[[2307,3722],[2216,3836]]}],"project_id":536,"difficulty":100,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"Ce projet a pour but de vous initier au développement d'application iOS. Il s'agit de réaliser, en Swift, une application qui permet de récupérer les informations des élèves de 42, en utilisant l’API de l'intranet de 42.","slug":"swifty-companion"},{"id":6082,"kind":"project","name":"Swifty Proteins","x":2111.76,"y":3951.05,"by":[{"parent_id":536,"points":[[2209,3837],[2110,3956]]}],"project_id":661,"difficulty":225,"duration":"about 21 days","rules":"You must have validated 1 of startup-internship and first-internship. You must have validated swifty-companion","description":"Ce projet a pour but de vous initier a Scene Kit un framework Apple pour créer scenes en 3D. Vous devrez principalement réaliser une application qui modélisera des ligands en 3D, cette application sera aussi l'occasion d'approfondir vos connaissances en Swift et des framework Apple tels que Touch ID, le partage sous iOS, les gestures ainsi que les UISearchBar.","slug":"swifty-proteins"},{"id":6083,"kind":"project","name":"avaj-launcher","x":2394.25,"y":3981.49,"by":[{"parent_id":118,"points":[[2488,3860],[2409,3976]]}],"project_id":870,"difficulty":100,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"First projet of the Java projects arc. Implementation of a simple Java program according to a given class diagram written in UML.","slug":"avaj-launcher"},{"id":6084,"kind":"project","name":"swingy","x":2280.93,"y":4057.03,"by":[{"parent_id":870,"points":[[2396,3979],[2290,4058]]}],"project_id":871,"difficulty":225,"duration":"about 14 days","rules":"You must have validated avaj-launcher. You must have validated 1 of startup-internship and first-internship","description":"This is the second project from the Java world at 42. You will learn to develop GUI applications with the SWING framework, in order to create an RPG game.","slug":"swingy"},{"id":6085,"kind":"project","name":"fix-me","x":2427.49,"y":4125.02,"by":[{"parent_id":870,"points":[[2400,3983],[2426,4118]]}],"project_id":872,"difficulty":375,"duration":"about 28 days","rules":"You must have validated avaj-launcher. You must have validated 1 of startup-internship and first-internship","description":"Final project of the Java Programming arc. Write a program that simulates stock exchanges and deals with trading algorithms, with networking and socket implementations. ","slug":"fix-me"},{"id":6086,"kind":"project","name":"ft_abstract_vm","x":2625.37,"y":4064.58,"by":[{"parent_id":118,"points":[[2686,3950],[2626,4070]]}],"project_id":2114,"difficulty":225,"duration":"about 21 days","rules":"You must have finished quest(s) start-condition","description":"This project invites you to create a virtual machine capable of executing code in basic pseudo-ASM. You will use a stack to do basic arithmetic operations, like the dc command.","slug":"ft_abstract_vm"},{"id":6087,"kind":"project","name":"ft_hangouts","x":2335.72,"y":3859.52,"by":[{"parent_id":118,"points":[[2459,3899],[2336,3860]]}],"project_id":409,"difficulty":100,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"Ce projet a pour but de vous initier au développement d'application Android. Il s'agit de réaliser, en JAVA, une application mobile de gestion de contacts sur la plateforme Android de Google.  Le but ici est de comprendre comment fonctionne une application Android, comment Android gère votre application et comment utiliser le SDK.","slug":"ft_hangouts"},{"id":6088,"kind":"project","name":"Darkly","x":1885.79,"y":2742.25,"by":[{"parent_id":118,"points":[[2026,2779],[1885,2746]]}],"project_id":604,"difficulty":225,"duration":"about 14 days","rules":"You must have finished quest(s) start-condition","description":"Projet introductif à la sécurité en informatique dans le domaine spécifique du web, ce projet va vous faire disséquer un site web vulnérable. Ce faisant, vous allez développer votre propre façon de penser sécurité dans une application web et prendre conscience des problèmes liés à de simples erreurs de développement, autant d'un point de vue programmation que d'un point de vue conception.","slug":"darkly"},{"id":6089,"kind":"project","name":"Process and Memory","x":2381.76,"y":1731.94,"by":[{"parent_id":696,"points":[[2299,1894],[2381,1729]]}],"project_id":709,"difficulty":225,"duration":"about 14 days","rules":"You must have validated little-penguin-1","description":"An introduction to syscalls and memory management within linux kernel","slug":"process-and-memory"},{"id":6090,"kind":"project","name":"Music Room","x":1877.22,"y":2990.64,"by":[{"parent_id":118,"points":[[2000,2978],[1873,2994]]}],"project_id":719,"difficulty":600,"duration":"about 28 days","rules":"You must have finished quest(s) start-condition","description":"Projet en partenariat avec Deezer. Créez en groupe une application mobile complète de playlist collaborative en utilisant les SDK et API de Deezer. Au programme : du développement natif mobile, du développement de back-end et de la création d'API REST.","slug":"music-room"},{"id":6091,"kind":"project","name":"Red Tetris","x":1868.51,"y":2862.87,"by":[{"parent_id":118,"points":[[2010,2859],[1898,2857]]}],"project_id":818,"difficulty":375,"duration":"about 21 days","rules":"You must have finished quest(s) start-condition","description":"L’objectif de ce projet est de développer un jeu de tetris multijoueurs en réseau à partir d’une pile logicielle exclusivement Full Stack Javascript","slug":"red-tetris"},{"id":6092,"kind":"project","name":"Snow Crash","x":1908.7,"y":2462.81,"by":[{"parent_id":118,"points":[[2098,2570],[1910,2465]]}],"project_id":603,"difficulty":375,"duration":"about 21 days","rules":"You must have finished quest(s) start-condition","description":"Projet introductif à la sécurité en informatique, Snow Crash a pour but de faire découvrir la sécurité dans différents sous-domaines, avec une approche orientée développeur. Vous allez vous familiariser avec plusieurs langages (ASM/perl/php..), développer une certaine logique pour comprendre des programmes inconnus, et ainsi prendre conscience des problèmes liés à de simples erreurs de programmation .","slug":"snow-crash"},{"id":6093,"kind":"project","name":"RainFall","x":1751.68,"y":2375.44,"by":[{"parent_id":603,"points":[[1911,2466],[1746,2374]]}],"project_id":699,"difficulty":600,"duration":"about 28 days","rules":"You must have validated snow-crash. You must have validated 1 of startup-internship and first-internship","description":"Rainfall est un iso de challenge légèrement plus complexe que Snow Crash qui vous plongera dans les méandres du reverse engineering et vous apprendra à reconstruire un code et à en comprendre son fonctionnement afin d'en dénicher les failles. Pourrez-vous atteindre le dernier level ?","slug":"rainfall"},{"id":6094,"kind":"project","name":"Override","x":1592.89,"y":2284.54,"by":[{"parent_id":699,"points":[[1751,2372],[1605,2290]]}],"project_id":912,"difficulty":850,"duration":null,"rules":"You must have validated rainfall","description":"Si Rainfall vous a paru facile, voila de quoi vous donner du fil a retordre. Override est la dernière ISO de challenge qui vous demandera de partir à la recherche de failles présents dans des binaires protégés, et reconstruire ces binaires en fonction de leur comportement.","slug":"override"},{"id":6095,"kind":"project","name":"Philosophers","x":3154.97,"y":1819.55,"by":[{"parent_id":36,"points":[[3000,1901],[3158,1814]]}],"project_id":39,"difficulty":100,"duration":"about 7 days","rules":"You must have validated malloc. You must have validated 1 of startup-internship and first-internship","description":"Comment gérer l’accès concurrentiel de plusieurs processus à des ressources partagées ? Ce projet vous initialise aux problématiques de la programmation parallèle via le fameux problème du « diner des philosophes ».","slug":"philosophers"},{"id":6096,"kind":"project","name":"Dr Quine","x":2145.78,"y":2340.69,"by":[{"parent_id":118,"points":[[2264,2264],[2170,2332]]}],"project_id":700,"difficulty":225,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"Ce petit projet d'algo vous permet d'aborder les problématiques de l'auto-réplication, et vous confronte au théorème de récursion de Kleene !","slug":"dr-quine"},{"id":6097,"kind":"project","name":"Woody Woodpacker","x":2195.34,"y":2189.65,"by":[{"parent_id":118,"points":[[2297,2288],[2227,2219]]}],"project_id":701,"difficulty":225,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"Projet dans la suite logique de nm/otools qui a pour principe de modifier les headers d'un fichier de type ELF64. Le but ici est de pouvoir ajouter un morceau de code et obfusquer une partie d'un fichier non strippé.","slug":"woody-woodpacker"},{"id":6098,"kind":"project","name":"Famine","x":2104.48,"y":2086.99,"by":[{"parent_id":701,"points":[[2208,2197],[2107,2096]]}],"project_id":820,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of startup-internship and first-internship. You must have validated woody-woodpacker","description":"Bienvenue dans le monde merveilleux des virus, trojans et autres hantises de <Insert random antiVirus software>... Votre but ici est de mettre vos compétences sur la manipulation des fichiers binaires et faire votre premier virus. ATTENTION : Ce projet est uniquement à but pédagogique.","slug":"famine"},{"id":6099,"kind":"project","name":"Pestilence","x":2003.0,"y":1986.69,"by":[{"parent_id":820,"points":[[2111,2095],[2010,1992]]}],"project_id":905,"difficulty":375,"duration":"about 28 days","rules":"You must have validated famine","description":"Second projet virus. Reprenez la base de Famine pour ajouter une méthode d'obfuscation de votre code.","slug":"pestilence"},{"id":6100,"kind":"project","name":"War","x":1901.52,"y":1876.95,"by":[{"parent_id":905,"points":[[2017,1992],[1910,1885]]}],"project_id":907,"difficulty":850,"duration":"about 28 days","rules":"You must have validated pestilence","description":"Troisième projet virus. Reprenez Pestilence, et faites en sorte que votre binaire modifie sa signature au runtime.","slug":"war"},{"id":6101,"kind":"project","name":"Death","x":1796.5,"y":1780.19,"by":[{"parent_id":907,"points":[[1914,1887],[1819,1797]]}],"project_id":908,"difficulty":850,"duration":null,"rules":"You must have validated war","description":"Dernier et ultime projet virus. Realiser a partir de Famine, Pestilence et War un veritable code metamorphique.","slug":"death"},{"id":6102,"kind":"project","name":"Nm-otool","x":2863.64,"y":1941.33,"by":[{"parent_id":36,"points":[[2996,1901],[2868,1950]]}],"project_id":37,"difficulty":225,"duration":"about 14 days","rules":"You must have validated malloc. You must have validated 1 of startup-internship and first-internship","description":"Décortiquez le format des exécutables MacOS et comprenez comment le kernel lance les binaires, en ré-écrivant ces deux outils du système. Indispensable pour tous ceux qui voudront faire de la sécurité, ce projet est plus généralement une ouverture sur la culture UNIX système.","slug":"nm-otool"},{"id":6103,"kind":"project","name":"strace","x":3002.0,"y":1540.56,"by":[{"parent_id":42,"points":[[3001,1717],[3002,1528]]}],"project_id":179,"difficulty":225,"duration":"about 7 days","rules":"You must have validated lem-ipc","description":"Premier pas d'une série de projets en C menant à la réalisation d'un mini-GDB, ce projet vous demande de recoder strace, un outil qui permet de lister tous les appels systèmes effectués par un programme en cours d'exécution.","slug":"strace"},{"id":6104,"kind":"project","name":"ft_ping","x":3845.11,"y":2249.64,"by":[{"parent_id":118,"points":[[3745,2332],[3847,2250]]}],"project_id":539,"difficulty":100,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"Recoder la commande ping va vous permettre d'avoir une première approche dans la communication (TCP/IP) entre deux machines dans un réseau.","slug":"ft_ping"},{"id":6105,"kind":"project","name":"GBmu","x":2856.15,"y":1808.31,"by":[{"parent_id":36,"points":[[2996,1899],[2855,1807]]}],"project_id":682,"difficulty":600,"duration":"about 60 days","rules":"You must have validated malloc. You must have validated 1 of startup-internship and first-internship","description":"Ce projet a pour but de vous faire coder un émulateur de gameboy normal et color. Vous allez ainsi vous familiariser avec la documentation electronique, mieux appréhender l’émulation de hardware et comprendre le fonctionnement interne d’une gameboy ainsi que des roms","slug":"gbmu"},{"id":6106,"kind":"project","name":"Matt Daemon","x":3152.16,"y":1944.14,"by":[{"parent_id":36,"points":[[3007,1901],[3150,1937]]}],"project_id":702,"difficulty":225,"duration":"about 7 days","rules":"You must have validated 1 of startup-internship and first-internship. You must have validated malloc","description":"Projet Unix dont le but est de créer un daemon de type serveur. Ce serveur va alors écouter sur un port donné et interpréter une liste de commandes.","slug":"matt-daemon"},{"id":6107,"kind":"project","name":"ft_p","x":3330.18,"y":1966.93,"by":[{"parent_id":118,"points":[[3292,2043],[3327,1964]]}],"project_id":40,"difficulty":225,"duration":"about 14 days","rules":"You must have finished quest(s) start-condition","description":"Ce projet introductif sur la programmation UNIX réseau vous invite à réaliser un client-serveur offrant des services identiques à ftp. Bonus : respectez le standard pour être interopérable avec les outils existants !","slug":"ft_p"},{"id":6108,"kind":"project","name":"IRC","x":3492.29,"y":2039.06,"by":[{"parent_id":118,"points":[[3460,2112],[3497,2049]]}],"project_id":41,"difficulty":225,"duration":"about 14 days","rules":"You must have finished quest(s) start-condition","description":"Ce projet sur la programmation UNIX réseau vous invite à réaliser un client-serveur offrant des services identiques à IRC. Votre implémentation devra utiliser correctement select(2) pour gérer la connexion simultanée des clients, ainsi que des buffers tournants pour gérer les messages des clients.","slug":"irc"},{"id":6109,"kind":"project","name":"Zappy","x":3467.0,"y":1862.82,"by":[{"parent_id":40,"points":[[3324,1964],[3462,1861]]},{"parent_id":41,"points":[[3494,2038],[3464,1867]]}],"project_id":43,"difficulty":600,"duration":"about 42 days","rules":"You must have validated 1 of startup-internship and first-internship. You must have validated 1 of irc and ft_p","description":"Ce projet est l’aboutissement de vos précédents efforts en UNIX avancé : vous allez ici réaliser un jeu multi-joueurs en réseau TCP/IP. Ce jeu sera constitué d’un serveur gérant le terrain de jeu, d’un client graphique qui affiche l'état du plateau, et de clients IA qui se connectent sur le serveur pour piloter un joueur sur le terrain. C'est un projet très complet qui vous donne l'occasion d'exprimer votre créativité en plus de vos connaissances techniques !","slug":"zappy"},{"id":6110,"kind":"project","name":"LibftASM","x":3940.2,"y":2418.57,"by":[{"parent_id":118,"points":[[3854,2480],[3907,2447]]}],"project_id":79,"difficulty":225,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"Ce projet a pour but de vous faire coder une minilib en ASM, en recodant quelques fonctions basiques de la libc. A la fin de ce projet vous serez familiarisés avec la syntaxe du langage, le fonctionnement de la stack, mais aussi le comportement du compilateur. Absolument indispensable pour continuer sur les projets de sécurité.","slug":"libftasm"},{"id":6111,"kind":"project","name":"ft_traceroute","x":3977.47,"y":2141.82,"by":[{"parent_id":539,"points":[[3845,2252],[3990,2137]]}],"project_id":548,"difficulty":100,"duration":"about 7 days","rules":"You must have validated ft_ping. You must doesn't have first-internship ongoing. You must have validated 1 of startup-internship and first-internship","description":"Recoder la commande traceroute va être pour vous l'occasion d'approfondir vos connaissances dans le reseau (TCP/IP) en faisant le suivit des chemins qu'un paquet IP va emprunter entre deux machines.","slug":"ft_traceroute"},{"id":6112,"kind":"project","name":"ft_nmap","x":4118.76,"y":2036.23,"by":[{"parent_id":548,"points":[[3977,2146],[4124,2030]]}],"project_id":593,"difficulty":375,"duration":"about 7 days","rules":"You must have validated ft_traceroute","description":"Recoder le programme nmap va être pour vous l'occasion d'approfondir vos connaissances dans le reseau (TCP/IP) et ainsi comprendre aussi via une utilisation avancee les threads dans un usage reel.","slug":"ft_nmap"},{"id":6113,"kind":"project","name":"ft_ssl_rsa","x":3842.88,"y":1857.14,"by":[{"parent_id":985,"points":[[3752,1994],[3855,1843]]}],"project_id":983,"difficulty":375,"duration":"about 7 days","rules":"You must have validated ft_ssl_des","description":"You will code your own random prime number generator and use it to make private RSA keys.","slug":"ft_ssl_rsa"},{"id":6114,"kind":"project","name":"ft_ssl_des","x":3752.0,"y":1994.54,"by":[{"parent_id":2112,"points":[[3659,2122],[3764,1992]]}],"project_id":985,"difficulty":225,"duration":"about 7 days","rules":"You must have validated 1 of startup-internship and first-internship. You must have validated ft_ssl_md5","description":"You will recode part of the OpenSSL program, specifically BASE64, DES-ECB and DES-CBC.","slug":"ft_ssl_des"},{"id":6115,"kind":"project","name":"Gomoku","x":4378.48,"y":2919.23,"by":[{"parent_id":534,"points":[[4242,2997],[4374,2918]]}],"project_id":107,"difficulty":600,"duration":"about 28 days","rules":"You must have validated 1 of startup-internship and first-internship. You must have validated rubik","description":"Ce projet vous demande de créer, dans le langage de votre choix, un jeu de Gomoku intégrant un joueur IA capable de battre un joueur humain le plus rapidement possible. Pour ce faire, vous allez implémenter un algorithme min-max mais aussi (et surtout), faire des recherches et essais pour trouver les heuristiques les plus adaptées. Ce ne sera pas aussi facile qu'un jeu de dames.","slug":"gomoku"},{"id":6116,"kind":"project","name":"Rubik","x":4245.35,"y":2995.99,"by":[{"parent_id":118,"points":[[3999,3000],[4263,3001]]}],"project_id":534,"difficulty":225,"duration":"about 14 days","rules":"You must have finished quest(s) start-condition","description":"Projet d'algorithmie non-trivial, ce projet a pour but de vous faire réaliser un résolveur de Rubik's Cube. Vous êtes libres dans le choix de langage pour réaliser le sujet.","slug":"rubik"},{"id":6117,"kind":"project","name":"ComputorV2","x":4238.82,"y":3355.34,"by":[{"parent_id":111,"points":[[4054,3287],[4230,3343]]}],"project_id":846,"difficulty":225,"duration":"about 21 days","rules":"You must have validated computorv1. You must have validated 1 of startup-internship and first-internship","description":"Maintenant que vous avez programmé votre résolveur d'équations, il est temps d'aller un peu plus loin. Computor V2 vous propose de créer votre propre calculette en ligne de commande, qui va intégrer votre computorv1 ainsi que des fonctions de calculs matriciels, de resolution de fonctions, de calculs sur nombre imaginaires etc...","slug":"computorv2"},{"id":6118,"kind":"project","name":"ft_linear_regression","x":4027.77,"y":2636.38,"by":[{"parent_id":118,"points":[[4058,2747],[4026,2642]]}],"project_id":414,"difficulty":100,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"This project will be your first steps into AI and Machine Learning. You're going to start with a simple, basic machine learning algorithm. \r\nYou will have to create a program that predicts the price of a car by using a linear function train with a gradient descent algorithm.","slug":"ft_linear_regression"},{"id":6119,"kind":"project","name":"KrpSim","x":4467.24,"y":2998.39,"by":[{"parent_id":534,"points":[[4243,2996],[4470,2997]]}],"project_id":522,"difficulty":225,"duration":"about 7 days","rules":"You must have validated rubik. You must have validated 1 of startup-internship and first-internship","description":"Ce projet d'algorithmie consiste à réaliser un programme qui va optimiser le rendement d’un graphe de processus, avec des contraintes de ressources. A vous d'explorer les algorithmes existants possibles et de choisir, voire de créer, ce qui vous semble le plus adapté. Vous êtes libres dans le choix de langage pour réaliser le sujet.","slug":"krpsim"},{"id":6120,"kind":"project","name":"DSLR","x":4180.79,"y":2711.78,"by":[{"parent_id":118,"points":[[3975,2777],[4192,2712]]}],"project_id":1081,"difficulty":144,"duration":"about 14 days","rules":"You must have finished quest(s) start-condition","description":"Sujet proposé par l'association 42AI.  Découvrez la Data Science à travers ce projet dans la reconstitution du Choixpeau Magique de Poudlard ! Attention, ceci n'est pas un sujet sur les appareils photos.","slug":"dslr"},{"id":6121,"kind":"project","name":"Multilayer Perceptron","x":4315.21,"y":2588.85,"by":[{"parent_id":1081,"points":[[4176,2713],[4312,2588]]}],"project_id":1162,"difficulty":225,"duration":"about 14 days","rules":"You must have validated 1 of startup-internship and first-internship. You must have validated dslr","description":"Sujet proposé par l'association 42AI.  Ce projet est une introduction aux réseaux de neurones artificiels grâce à l'implémentation d'un multilayer perceptron.","slug":"multilayer-perceptron"},{"id":6122,"kind":"project","name":"Total-perspective-vortex","x":4358.51,"y":2724.42,"by":[{"parent_id":1081,"points":[[4183,2709],[4359,2724]]}],"project_id":1203,"difficulty":225,"duration":"about 14 days","rules":"You must have validated dslr. You must have validated 1 of startup-internship and first-internship","description":"Apprenez à utiliser les outils python pour traiter des données en grandes dimensions, et créez une interface homme machine grâce aux ondes cérébrales.","slug":"total-perspective-vortex"},{"id":6123,"kind":"project","name":"ft_linux","x":2411.73,"y":2055.11,"by":[{"parent_id":118,"points":[[2472,2151],[2418,2075]]}],"project_id":695,"difficulty":100,"duration":"about 7 days","rules":"You must have finished quest(s) start-condition","description":"Le premier projet de la branche Kernel ! Il s'agit d'un simple LFS, afin que vous construisiez votre propre distribution sur laquelle vous travaillerez ensuite pour les prochains projets.","slug":"ft_linux"},{"id":6124,"kind":"project","name":"little-penguin-1","x":2298.39,"y":1896.8,"by":[{"parent_id":695,"points":[[2411,2055],[2298,1905]]}],"project_id":696,"difficulty":225,"duration":"about 14 days","rules":"You must have validated ft_linux. You must have validated 1 of startup-internship and first-internship","description":"Le début d'une série de challenges inspirés du challenge Eudyptula, vous permettant d'aborder de nombreux points du developpement Kernel.","slug":"little-penguin-1"},{"id":6125,"kind":"project","name":"Drivers and Interrupts","x":2475.43,"y":1869.64,"by":[{"parent_id":696,"points":[[2302,1895],[2476,1870]]}],"project_id":710,"difficulty":375,"duration":"about 14 days","rules":"You must have validated little-penguin-1","description":"Learn how to connect a driver to your kernel. We will use a keyboard driver for this project.","slug":"drivers-and-interrupts"},{"id":6126,"kind":"project","name":"Filesystem","x":2551.31,"y":1724.45,"by":[{"parent_id":709,"points":[[2375,1726],[2542,1725]]},{"parent_id":710,"points":[[2479,1868],[2550,1726]]}],"project_id":711,"difficulty":375,"duration":"about 28 days","rules":"You must have validated 1 of process-and-memory and drivers-and-interrupts","description":"Create your own filesystem, for your linux kernel.","slug":"filesystem"},{"id":6127,"kind":"project","name":"userspace_digressions","x":2554.12,"y":1976.43,"by":[{"parent_id":695,"points":[[2415,2059],[2550,1984]]}],"project_id":1119,"difficulty":225,"duration":"about 42 days","rules":"You must have validated ft_linux","description":"Make your own userspace init binary.","slug":"userspace_digressions"},{"id":6128,"kind":"project","name":"KFS-2","x":2289.04,"y":1593.83,"by":[{"parent_id":716,"points":[[2170,1741],[2298,1597]]}],"project_id":714,"difficulty":375,"duration":"about 42 days","rules":"You must have validated kfs-1","description":"Discover the world of \"Kernel Programming\" and learn how to create your very own Kernel from scratch.","slug":"kfs-2"},{"id":6129,"kind":"project","name":"KFS-1","x":2170.12,"y":1718.7,"by":[{"parent_id":696,"points":[[2299,1908],[2173,1744]]}],"project_id":716,"difficulty":375,"duration":"about 42 days","rules":"You must have validated little-penguin-1","description":"Discover the world of \"Kernel Programming\" and learn how to create your very own Kernel from scratch.","slug":"kfs-1"},{"id":6130,"kind":"project","name":"KFS-3","x":2407.96,"y":1471.94,"by":[{"parent_id":714,"points":[[2283,1614],[2407,1477]]}],"project_id":717,"difficulty":850,"duration":"about 42 days","rules":"You must have validated kfs-2","description":"Third \"Kernel from Scratch\" project. Learn how to manage the memory in you kernel.","slug":"kfs-3"},{"id":6131,"kind":"project","name":"KFS-4","x":2535.8,"y":1341.13,"by":[{"parent_id":717,"points":[[2407,1471],[2544,1323]]}],"project_id":824,"difficulty":600,"duration":"about 28 days","rules":"You must have validated kfs-3","description":"Projet visant a créer une Interrupt Description Table et gerer les interruptions avec votre Kernel.","slug":"kfs-4"},{"id":6132,"kind":"project","name":"KFS-5","x":2663.63,"y":1219.24,"by":[{"parent_id":824,"points":[[2536,1333],[2677,1191]]}],"project_id":825,"difficulty":850,"duration":"about 56 days","rules":"You must have validated kfs-4","description":"A vous maintenant de développer la gestion des process dans votre Kernel, en implementant de quoi interpréter la commande :(){ :|:& }","slug":"kfs-5"},{"id":6133,"kind":"project","name":"KFS-6","x":2586.19,"y":1101.54,"by":[{"parent_id":825,"points":[[2666,1191],[2585,1095]]}],"project_id":873,"difficulty":600,"duration":"about 42 days","rules":"You must have validated kfs-5","description":"Keep on developping your own kernel. This project will help you set up your own filesystem.","slug":"kfs-6"},{"id":6134,"kind":"project","name":"KFS-7","x":2460.57,"y":1215.73,"by":[{"parent_id":873,"points":[[2587,1093],[2459,1220]]}],"project_id":874,"difficulty":850,"duration":"about 90 days","rules":"You must have validated kfs-6","description":"This project will teach you how to build your own syscalls for your kernel, as well as user accounts, sockets, and a Unix-like hierarchy. Almost a full kernel here!","slug":"kfs-7"},{"id":6135,"kind":"project","name":"KFS-8","x":2327.34,"y":1341.35,"by":[{"parent_id":874,"points":[[2459,1216],[2333,1349]]}],"project_id":876,"difficulty":375,"duration":"about 28 days","rules":"You must have validated kfs-7","description":"Build a module interface for your kernel.","slug":"kfs-8"},{"id":6136,"kind":"project","name":"KFS-9","x":2215.05,"y":1463.16,"by":[{"parent_id":876,"points":[[2331,1348],[2207,1479]]}],"project_id":877,"difficulty":375,"duration":"about 35 days","rules":"You must have validated kfs-8","description":"Create an ELF parser and loader for your kernel.","slug":"kfs-9"},{"id":6137,"kind":"project","name":"KFS-X","x":2102.75,"y":1579.26,"by":[{"parent_id":877,"points":[[2214,1465],[2100,1592]]}],"project_id":882,"difficulty":850,"duration":"about 56 days","rules":"You must have validated kfs-9","description":"This is the final kernel project. It just requires you to create a complete linux environment. Maybe name your kernel aswell?","slug":"kfs-x"}]