[{"id":3,"kind":"big_project","name":"Corewar","x":3900.0,"y":3000.0,"by":[{"parent_id":29,"points":[[3600,3000],[3900,3000]]}],"project_id":22,"difficulty":"Tier 3","duration":"about 4 weeks","rules":"You must have validated 1 of lem_in and first-internship","description":"Ce projet vous invite à créer une arène virtuelle et à y faire s’affronter des programmes codés dans un langage simpliste. Vous allez ainsi aborder la conception d’une VM (avec les instructions qu’elle reconnait, les registres, etc), et les problématiques de compilation d’un langage assembleur en bytecode. Avec, en bonus, le plaisir de faire s’affronter vos champions sur votre arène !","slug":"corewar"},{"id":6,"kind":"exam","name":"C Exam Alone In The Dark - Beginner","x":2362.0,"y":3424.0,"by":[],"project_id":11,"difficulty":"Tier 1","duration":"about 1 week","rules":"","description":"Les examens machine permettent de vérifier vos acquis lorsque vous êtes seuls face à votre travail, sans vos peers et sans internet.\r\nPour valider ce projet (qui est un pré-requis à votre départ en 1er stage), il vous faut valider 5 examens avec une note minimum de 75.","slug":"c-exam-alone-in-the-dark-beginner"},{"id":8,"kind":"piscine","name":"Piscine PHP","x":2600.0,"y":2744.0,"by":[],"project_id":48,"difficulty":"Tier 1","duration":null,"rules":"You must be at least level 5 in cursus 42","description":"La piscine PHP va vous permettre d'accéder aux technologies de base du web.","slug":"piscine-php"},{"id":15,"kind":"project","name":"42run","x":2900.0,"y":4250.0,"by":[{"parent_id":135,"points":[[3000,4250],[2900,4250]]}],"project_id":178,"difficulty":"Tier 2","duration":"about 2 weeks","rules":"You must have validated scop. You must have validated first-internship","description":"Vous connaissez Temple Run ? Il est temps de le refaire ! Ce projet intermédiaire d'OpenGL vous invite à recréer ce jeu mobile. Amusez-vous : tous les bonus sont possible pour dépasser la célèbre franchise.","slug":"42run"},{"id":25,"kind":"project","name":"FdF","x":3002.0,"y":3206.0,"by":[{"parent_id":15,"points":[[3002,3206],[3003.5,3444.5]]},{"parent_id":540,"points":[[3002,3206],[3002,3001]]}],"project_id":4,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated get_next_line and fillit","description":"Tous les programmes que vous avez écris jusqu'à maintenant s'exécutaient uniquement en mode texte dans votre terminal.\r\nDécouvrons maintenant quelque chose de plus excitant : comment ouvrir une fenêtre graphique et dessiner dedans ?\r\nPour commencer votre voyage au pays de la programmation graphique, FdF vous propose de représenter le maillage en \"fils de fer\" d'un terrain en 3D.","slug":"fdf"},{"id":27,"kind":"project","name":"Wolf3d","x":2898.0,"y":3678.0,"by":[{"parent_id":15,"points":[[3003,3444],[2898,3678]]}],"project_id":8,"difficulty":"Tier 2","duration":"about 2 weeks","rules":"You must have validated 1 of fract-ol and first-internship","description":"Inspiré du célèbre jeu éponyme des années 90 qui fut le premier First Person Shooter, ce projet vous permet d'aborder la technique du ray-casting. Votre but sera de représenter une vue dynamique à l'intérieur d'un labyrinthe dans lequel on peut se déplacer.","slug":"wolf3d"},{"id":28,"kind":"project","name":"RTv1","x":3112.0,"y":3678.0,"by":[{"parent_id":15,"points":[[3003.5,3444.5],[3112,3678]]}],"project_id":23,"difficulty":"Tier 2","duration":"about 2 weeks","rules":"You must have validated 1 of fract-ol and first-internship","description":"Découvrez les principes fondamentaux du Raytracing : la création d'images de synthèses par ordinateur. Ce premier projet vous fera réaliser des scènes simples impliquant des objets et des lumières non complexes.","slug":"rtv1"},{"id":29,"kind":"big_project","name":"RT","x":3111.0,"y":3893.0,"by":[{"parent_id":23,"points":[[3112,3678],[3111,3893]]}],"project_id":24,"difficulty":"Tier 3","duration":"about 6 weeks","rules":"You must have validated 1 of rtv1 and first-internship","description":"Passez à la vitesse supérieure ! Suite du Rtv1, le RT pousse beaucoup plus loin les possibilités du Raytracing : effet miroir, transparence, découpe des objets, applications de textures... Capitalisez sur le projet précédent pour réaliser une infrastructure capable de supporter toutes ces ramifications et obtenir de sublimes images de synthèse.","slug":"rt"},{"id":35,"kind":"project","name":"ft_ls","x":2999.0,"y":2800.0,"by":[{"parent_id":540,"points":[[3001,2793],[3002,3005]]}],"project_id":3,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated get_next_line and fillit","description":"Pour tout connaitre du filesystem, de la façon dont sont rangés les fichiers et répertoires, codez par vous-même une des commandes les plus utilisées : ls .","slug":"ft_ls"},{"id":37,"kind":"project","name":"minishell","x":3000.0,"y":2600.0,"by":[{"parent_id":3,"points":[[2999,2801],[3000,2593]]}],"project_id":7,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated 1 of ft_ls and first-internship","description":"Première étape de la réalisation d'un shell. Dans ce projet, vous devez réaliser un mini-shell capable de lire et d'évaluer des commandes simples de l'utilisateur. La lecture impliquera une analyse lexicale et syntaxique triviale de la commande, et l'évaluation impliquera de rechercher le binaire correspondant sur la machine et l'exécuter, ou bien d'exécuter le code concerné dans le cas d'une commande \"built-in\" au shell.","slug":"minishell"},{"id":38,"kind":"project","name":"ft_select","x":2800.0,"y":2450.0,"by":[{"parent_id":7,"points":[[2999,2591],[3000,2450]]},{"parent_id":7,"points":[[3000,2450],[2800,2450]]}],"project_id":33,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated 1 of minishell and first-internship","description":"Ce projet a pour but de vous initier à la manipulation du terminal avec les termcaps. Vous allez ici apprendre à créer une interface utilisateur pour un programme lancé dans le terminal.","slug":"ft_select"},{"id":39,"kind":"project","name":"21sh","x":3000.0,"y":2350.0,"by":[{"parent_id":7,"points":[[3000,2550],[3000,2350]]}],"project_id":523,"difficulty":"Tier 2","duration":"about 2 weeks","rules":"You must not have validated ft_sh2 and ft_sh3. You must have validated 1 of minishell and first-internship","description":"On passe aux choses sérieuses ! Avec 21sh, vous allez devoir écrire une implémentation proche de la réalité de la boucle \"read, eval, print\" d'un shell.\r\nA l'aide de la bibliothèque Termcaps, vous ajouterez une édition de ligne fonctionnelle et utile à la partie \"read\" de votre shell. Déplacements du curseur, édition, historique, multilignes, etc.\r\nMais surtout pour la partie \"eval\", oubliez la fonction ft_split que vous utilisiez dans votre Minishell pour découper la ligne de commande entrée par l'utilisateur ! \r\n21sh sera votre premier interprète réaliste, et en tant que tel, ce projet vous permettra de découvrir les analyses lexicale, syntaxique, et sémantique communes aux interprètes et aux compilateurs.\r\nAvec des structures de données et des traitements adaptées, ajouter la gestions des pipes (\"|\") et des redirections (\"<\", \"<<\", \">>\". \">\") sera très simple !","slug":"21sh"},{"id":49,"kind":"project","name":"Abstract VM","x":2400.0,"y":4350.0,"by":[{"parent_id":62,"points":[[2400,4039],[2400,4350]]}],"project_id":80,"difficulty":"Tier 2","duration":"about 3 weeks","rules":"You must have validated piscine-cpp","description":"Ce projet vous remet dans le bain après la piscine C++ et vous invite à réaliser une machine virtuelle capable d'exécuter un code en pseudo-ASM basique. Vous allez ainsi utiliser une stack pour faire des opérations arithmétiques basiques, à l'instar de la commande dc.","slug":"abstract-vm"},{"id":50,"kind":"project","name":"Bomberman","x":2300.0,"y":4600.0,"by":[{"parent_id":80,"points":[[2300,4450],[2300,4600]]}],"project_id":410,"difficulty":"Tier 3","duration":"about 4 weeks","rules":"You must have validated abstract-vm. You must have validated first-internship","description":"Bomberman, c'est un classique du jeu video : aussi simple dans son gameplay que fun à jouer ! Vous allez ici profiter de sa simplicité pour faire votre premier gros projet de C++ de facture professionnelle. Vous allez recoder une version de Bomberman, en C++ et avec OpenGL, avec pour objectif de réaliser un jeu le plus abouti possible.","slug":"bomberman"},{"id":56,"kind":"project","name":"Nibbler","x":2200.0,"y":4450.0,"by":[{"parent_id":80,"points":[[2400,4350],[2300,4455]]},{"parent_id":80,"points":[[2300,4450],[2200,4450]]}],"project_id":95,"difficulty":"Tier 2","duration":"about 2 weeks","rules":"You must have validated abstract-vm","description":"Ce projet de C++ vous fait recoder le jeu Snake avec plusieurs interfaces graphiques différentes; le joueur devant pouvoir switcher entre les interfaces pendant le jeu. C'est l'occasion de voir comment charger et utiliser des bibliothèques dynamiques au runtime.","slug":"nibbler"},{"id":58,"kind":"project","name":"Camagru","x":2600.0,"y":2600.0,"by":[{"parent_id":48,"points":[[2600,2744],[2600,2600]]}],"project_id":537,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated 1 of piscine-php and first-internship","description":"Ce premier projet vous remet dans le bain après la piscine PHP : vous allez devoir réaliser, en PHP, un petit site Instagram-like permettant à des utilisateurs de réaliser et partager des photo-montages. Vous allez ainsi implémenter, à mains nues (les frameworks sont interdits), les fonctionnalités de base rencontrées sur la majorité des sites possédant une base utilisateur.","slug":"camagru"},{"id":59,"kind":"project","name":"Matcha","x":2500.0,"y":2500.0,"by":[{"parent_id":537,"points":[[2570,2570],[2500,2500]]}],"project_id":596,"difficulty":"Tier 2","duration":"about 2 weeks","rules":"You must have validated 1 of camagru and first-internship","description":"Ce second projet vous introduit à un outil plus évolué pour réaliser vos applications web : le micro-framework. Nous vous invitons à réaliser, dans le langage de votre choix, un site de rencontres. Les interactions entre utilisateurs seront au coeur du projet !","slug":"matcha"},{"id":60,"kind":"big_project","name":"Hypertube","x":2370.0,"y":2370.0,"by":[{"parent_id":596,"points":[[2500,2500],[2370,2370]]}],"project_id":597,"difficulty":"Tier 3","duration":"about 4 weeks","rules":"You must have validated 1 of matcha and first-internship","description":"Dernier projet de sa série, le projet Hypertube vous invite à découvrir une catégorie d'outil extrêmement puissante : les frameworks MVC. Vous apprendrez à manipuler un MVC, dans le langage de votre choix, pour réaliser un site de streaming de video téléchargées via le protocole BitTorrent.","slug":"hypertube"},{"id":99,"kind":"project","name":"ft_printf","x":3201.0,"y":3000.0,"by":[{"parent_id":540,"points":[[3201,3000],[3008.5,2999.5]]}],"project_id":5,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated get_next_line and fillit","description":"Vous en avez assez de faire vos affichages en alternant ft_putstr et ft_putnbr ? Vous n'avez pas le droit d'utiliser printf ? Recodez le votre ! Ce sera l'occasion de découvrir une feature du C - les fonctions variadiques - et de vous entrainer à la gestion fine des options d'affichage. Vous aurez ensuite le droit d'utiliser votre printf dans tous vos projets ultérieurs.","slug":"ft_printf"},{"id":101,"kind":"project","name":"Filler","x":3396.0,"y":2864.0,"by":[{"parent_id":5,"points":[[3201,3001],[3396,2864]]}],"project_id":26,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated 1 of ft_printf and first-internship","description":"Créez votre joueur pour affronter d’autres étudiants sur le célèbre (ou pas) plateau du Filler. Le principe est simple : deux joueurs s’affrontent sur un plateau, et doivent placer, tour à tour, la pièce que le maître du jeu (fourni sous la forme d’un exécutable Ruby) leur donne, gagnant ainsi des points. La partie s’arrête dès qu’une pièce ne peut plus être placée. Petit projet ludique !","slug":"filler"},{"id":102,"kind":"project","name":"Push_swap","x":3400.0,"y":3150.0,"by":[{"parent_id":5,"points":[[3201,3001],[3400,3150]]}],"project_id":27,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated 1 of ft_printf and first-internship","description":"Ce projet vous demande de trier des données sur une pile, avec un set d’instructions limité, en moins de coups possibles. Pour le réussir, vous devrez manipuler différents algorithmes de tri et choisir la (ou les ?) solution la plus appropriée pour un classement optimisé des données.","slug":"push_swap"},{"id":103,"kind":"project","name":"Lem_in","x":3600.0,"y":3000.0,"by":[{"parent_id":26,"points":[[3396,2864],[3600,3000]]},{"parent_id":27,"points":[[3400,3150],[3600,3000]]}],"project_id":29,"difficulty":"Tier 2","duration":"about 2 weeks","rules":"You must have validated 1 of push_swap, filler, and first-internship","description":"Votre colonie de fourmis doit se déplacer d'un point à un autre. Mais comment faire pour que cela prenne le moins de temps possible ? Ce projet vous fait découvrir les algorithmes de parcours de graphe : votre programme devra sélectionner intelligemment les chemins et les mouvements précis qui doivent être empruntés par ces fourmis.","slug":"lem_in"},{"id":114,"kind":"project","name":"cloud-1","x":3683.0,"y":2040.0,"by":[{"parent_id":0,"points":[[3683,2040],[3555,2173]]}],"project_id":694,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have finished quest(s) first-internship","description":"Ce projet est une introduction aux serveurs en cloud.","slug":"cloud-1"},{"id":183,"kind":"project","name":"Libft","x":2550.0,"y":3000.0,"by":[{"parent_id":756,"points":[[2348,3001],[2550,3000]]}],"project_id":1,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated piscine-reloaded","description":"Ce premier projet en tant qu'étudiant de 42 va vous faire consolider vos acquis de piscine. Vous allez recoder un certain nombre de fonctions de la librairie C standard, ainsi que d'autres fonctions utilitaires que vous réutiliserez tout au long de votre cursus.","slug":"libft"},{"id":185,"kind":"project","name":"Get_Next_Line","x":2792.0,"y":3001.0,"by":[{"parent_id":1,"points":[[2792,3001],[2552.5,2999.5]]}],"project_id":2,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated libft","description":"Qu'il s'agisse d'un fichier, de l'entrée standard, ou même plus tard d'une connexion réseau, vous aurez toujours besoin de lire du contenu ligne par ligne. Il est donc temps de vous attaquer à cette fonction, indispensable pour un certain nombre de vos prochains projets.","slug":"get_next_line"},{"id":196,"kind":"project","name":"docker-1","x":2700.0,"y":3300.0,"by":[{"parent_id":687,"points":[[2850,3149],[2700,3300]]}],"project_id":847,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated 1 of init and first-internship","description":"Premier projet sur l'écosystème Docker. Apprenez à réfléchir en containers à travers ce sujet, qui vous fera manipuler le binaire docker et créer vos premiers containers avec des Dockerfiles","slug":"docker-1"},{"id":200,"kind":"project","name":"avaj-launcher","x":2100.0,"y":4350.0,"by":[{"parent_id":62,"points":[[2220,4200],[2220,4303]]},{"parent_id":62,"points":[[2220,4300],[2100,4350]]}],"project_id":870,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated piscine-cpp","description":"First projet of the Java projects arc. Implementation of a simple Java program according to a given class diagram written in UML.","slug":"avaj-launcher"},{"id":201,"kind":"project","name":"swingy","x":1950.0,"y":4420.0,"by":[{"parent_id":870,"points":[[2100,4350],[1950,4420]]}],"project_id":871,"difficulty":"Tier 2","duration":"about 2 weeks","rules":"You must have validated avaj-launcher","description":"This is the second project from the Java world at 42. You will learn to develop GUI applications with the SWING framework, in order to create an RPG game.","slug":"swingy"},{"id":202,"kind":"project","name":"fix-me","x":1800.0,"y":4490.0,"by":[{"parent_id":871,"points":[[1950,4420],[1800,4490]]}],"project_id":872,"difficulty":"Tier 3","duration":"about 4 weeks","rules":"You must have validated swingy","description":"Final project of the Java Programming arc. Write a program that simulates stock exchanges and deals with trading algorithms, with networking and socket implementations. ","slug":"fix-me"},{"id":235,"kind":"project","name":"Curriculum Vitae","x":3425.0,"y":3425.0,"by":[],"project_id":902,"difficulty":"Tier 0","duration":"about 2 days","rules":"You must be at least level 5 in cursus 42","description":"Tout aussi créatif, atypique, ou particulier que vous puissiez être, il existe certains codes sociaux dans le monde du travail que vous ne pourrez que difficilement contourner, tout du moins dans l’immédiat.\r\nVotre intégration professionnelle figurant en bonne place dans les objectifs de l’école, il est naturel que nous vous intéressions à cette porte d’entrée (parmi d’autres) que constitue l’établissement de votre CV.","slug":"curriculum-vitae"},{"id":374,"kind":"big_project","name":"Doom Nukem","x":2896.0,"y":3893.0,"by":[{"parent_id":8,"points":[[2898,3679],[2896.5,3893.5]]}],"project_id":1182,"difficulty":"Tier 3","duration":"about 6 weeks","rules":"You must have validated 1 of wolf3d and first-internship","description":"Passez à la vitesse supérieure ! Suite du Wolf3D, le Doom Nukem pousse beaucoup plus loin les possibilités du Raycasting tout en y apportant une dimension de Game design, vous allez donc devoir réaliser un vrai jeu et pour cela c’est un mélange de Doom et de Duke Nukem 3D qu’il vous faudra réaliser ! De nombreux éléments fonctionnels de base sont identiques. Ils n’ont cependant pas été implémentés de la même façon par les concepteurs des deux jeux. A vous de trouver celle qui vous conviendra et qui vous permettra d’ajouter les features demandées comme celles que vous souhaitez y voir.","slug":"doom-nukem"},{"id":375,"kind":"project","name":"GUImp","x":3196.0,"y":3441.0,"by":[{"parent_id":15,"points":[[3196,3441],[3003,3440]]}],"project_id":1117,"difficulty":"Tier 2","duration":"about 3 weeks","rules":"You must have validated 1 of fract-ol and first-internship","description":"L'objectif de ce projet sera pour vous de réaliser une librairie d'interface graphique. Vous devrez prouver son bon fonctionnement avec un petit logiciel d'édition d'image 2D.\r\nCette librairie devra être la plus complète et modulable possible, l'objectif étant de la réutiliser dans vos futurs projets, que ce soit pour vos projets de la branche graphique ou vos autres projets du cursus.","slug":"guimp"},{"id":488,"kind":"project","name":"Total-perspective-vortex","x":4595.0,"y":2951.0,"by":[{"parent_id":1081,"points":[[4595,2951],[4597,2795]]}],"project_id":1203,"difficulty":"Tier 2","duration":"about 2 weeks","rules":"You must have validated dslr","description":"Apprenez à utiliser les outils python pour traiter des données en grandes dimensions, et créez une interface homme machine grâce aux ondes cérébrales.","slug":"total-perspective-vortex"}]