[{"id":6,"kind":"exam","name":"C Exam Alone In The Dark - Beginner","x":2350.0,"y":3450.0,"by":[],"project_id":11,"difficulty":"Tier 1","duration":"about 1 week","rules":"","description":"Les examens machine permettent de vérifier vos acquis lorsque vous êtes seuls face à votre travail, sans vos peers et sans internet.\r\nPour valider ce projet (qui est un pré-requis à votre départ en 1er stage), il vous faut valider 5 examens avec une note minimum de 75.","slug":"c-exam-alone-in-the-dark-beginner"},{"id":25,"kind":"project","name":"FdF","x":3002.0,"y":3206.0,"by":[{"parent_id":2,"points":[[3002,3000],[3002.5,3206.5]]},{"parent_id":15,"points":[[3002.5,3206.5],[3003.5,3444.5]]}],"project_id":4,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated get_next_line","description":"Tous les programmes que vous avez écris jusqu'à maintenant s'exécutaient uniquement en mode texte dans votre terminal.\r\nDécouvrons maintenant quelque chose de plus excitant : comment ouvrir une fenêtre graphique et dessiner dedans ?\r\nPour commencer votre voyage au pays de la programmation graphique, FdF vous propose de représenter le maillage en \"fils de fer\" d'un terrain en 3D.","slug":"fdf"},{"id":183,"kind":"project","name":"Libft","x":2550.0,"y":3000.0,"by":[{"parent_id":756,"points":[[2348,3001],[2550,3000]]}],"project_id":1,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated piscine-reloaded","description":"Ce premier projet en tant qu'étudiant de 42 va vous faire consolider vos acquis de piscine. Vous allez recoder un certain nombre de fonctions de la librairie C standard, ainsi que d'autres fonctions utilitaires que vous réutiliserez tout au long de votre cursus.","slug":"libft"},{"id":185,"kind":"project","name":"Get_Next_Line","x":3002.0,"y":3000.0,"by":[{"parent_id":687,"points":[[3002,3000],[2850,3149]]}],"project_id":2,"difficulty":"Tier 1","duration":"about 1 week","rules":"You must have validated fillit","description":"Qu'il s'agisse d'un fichier, de l'entrée standard, ou même plus tard d'une connexion réseau, vous aurez toujours besoin de lire du contenu ligne par ligne. Il est donc temps de vous attaquer à cette fonction, indispensable pour un certain nombre de vos prochains projets.","slug":"get_next_line"}]